[{"id":219,"testExecKey":"TEST-457","testKey":"TEST-385","status":"FAIL","type":"Manual","start":"2018-08-08T14:20:28+02:00","finish":"2018-08-08T14:22:37+02:00","executedBy":"clande","defects":[],"evidences":[],"steps":[{"status":"PASS","defects":[],"evidences":[]},{"status":"EXECUTING","defects":[],"evidences":[]},{"status":"EXECUTING","defects":[],"evidences":[]},{"status":"FAIL","defects":[],"evidences":[]},{"status":"FAIL","defects":[],"evidences":[]}],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1100 - Modificar Personas","customfield_12404":{"steps":[{"id":590,"index":1,"step":"1 - Acceder al Maestro de Personas: Operativa Comercial -> Contratación -> Proceso Contratación -> Personas.","data":"","result":"Se muestra el maestro de personas. Los elementos se muestran según estandares de CF.","attachments":[]},{"id":591,"index":2,"step":"2 - Verificar que la LOPD no está activa: Datos maestros -> Parámetros funcionales. Comprobar que el parámetro LOPD tiene asignado el valor NO","data":"","result":"El botón Añadir se encuentra habilitado y permite añadir una nueva Persona.","attachments":[]},{"id":592,"index":3,"step":"3 - Verificar que la LOPD está activa: Datos maestros -> Parámetros funcionales. Comprobar que el parámetro LOPD tiene asignado el valor SI","data":"","result":"El botón Añadir se encuentra deshabilitado y no permite añadir una nueva Persona.","attachments":[]},{"id":593,"index":4,"step":"4 - Buscar una persona pre-existente en el sistema y realizar las siguientes modificaciones: Añadir Señas de cobro a la persona: Ir a Operativa Comercial -> Contratación > Proceso de contratación -> Personas > Pestaña Señas de Cobro. Pulsar sobre el botón Añadir.","data":"","result":"Comprobar que la persona se modifica correctamente, y los cambios aparecen refelejados en el histórico.","attachments":[]},{"id":594,"index":5,"step":"5 - Añadir algunos de los roles siguientes a la persona: Impresor, Distribuidor, Ensobrador, Transportista. Ir a Operativa Comercial -> Contratación > Proceso de contratación -> Personas > Pulsar sobre el botón Añadir rol. Elegir un rol del desplegable y completar los datos.","data":"","result":"Comprobar que la persona se modifica correctamente y que se activan las pestañas de cada rol con los cambios realizados.","attachments":[]}]}}},{"id":220,"testExecKey":"TEST-457","testKey":"TEST-386","status":"PASS","type":"Manual","start":"2018-08-08T14:22:57+02:00","finish":"2018-08-08T14:23:24+02:00","executedBy":"clande","defects":[],"evidences":[],"steps":[{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]}],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1200 - Crear dirección","customfield_12404":{"steps":[{"id":595,"index":1,"step":"1 - Acceder al detalle de una Persona existente. Ir a Operativa Comercial -> Contratación -> Proceso de contratación -> Personas -> Pestaña Datos personales.","data":"","result":"Se carga la ventana de Detalle de persona, y en la Pestaña datos personales, aparecen las direcciones de la persona.","attachments":[]},{"id":596,"index":2,"step":"2 - Pulsar sobre el botón Añadir'para introducir una nueva dirección'","data":"","result":"Se abre la ventana de detalle, con los campos para introducir una dirección","attachments":[]},{"id":597,"index":3,"step":"3 - Pulsar sobre el botón Añadir en la ventana de detalle de dirección.","data":"","result":"Se abre nueva ventana con detalle de nueva dirección","attachments":[]},{"id":598,"index":4,"step":"4 - Seleccionar Callejero como tipo de dirección, e ir seleccionando los datos de la nueva dirección: País > Comunidad > Provincia > Población > Localidad... Y a continuación el resto de datos de calle y número Aceptar, para realizar el alta","data":"","result":"El sistema va ofreciendo los datos de la cada uno de los campos de la dirección. Se acepta la dirección y se muestra en la ventana de maestro.","attachments":[]},{"id":599,"index":5,"step":"5 - Seleccionar la nueva dirección, que aparece en la tabla de la ventana y Aceptar.","data":"","result":"Se acepta la dirección. Y el sistema muestra la ventana de detalle de la persona, donde aparece la nueva dirección.","attachments":[]},{"id":600,"index":6,"step":"6 - Repetir el proceso anterior para direcciones de tipo: Descriptivo, E-mail y apartado de correos","data":"","result":"Se crean las direcciones correctamente, y aparecen en el detalle de la Persona.","attachments":[]}]}}},{"id":221,"testExecKey":"TEST-457","testKey":"TEST-387","status":"PASS","type":"Manual","start":"2018-08-08T14:24:40+02:00","finish":"2018-08-08T14:24:40+02:00","executedBy":"clande","defects":[],"evidences":[],"steps":[{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]},{"status":"PASS","defects":[],"evidences":[]}],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1300 - Crear Acometida","customfield_12404":{"steps":[{"id":601,"index":1,"step":"1 - Ir a la entrada de menú: Operativa Comercial -> Contratación -> Oficina técnica -> Acometidas","data":"","result":"Aparece la ventana de maestro de acometidas","attachments":[]},{"id":602,"index":2,"step":"2 - Hacer Añadir'para incorporar una nueva acometida'","data":"","result":"Se abre la ventana de detalle de la acometida, únicamente con los datos por defecto cargados.","attachments":[]},{"id":603,"index":3,"step":"3 - Completar los datos obligatorios de la acometida: Tipo de estructura técnica Tipo de acometida Sector y subsector hidráulicos Dirección donde se ubica la acometida Datos generales.","data":"","result":"El sistema permite registrar correctamente los datos de la acometida (a partir de los combos y valores precargados) y se crea el nuevo objeto.","attachments":[]},{"id":604,"index":4,"step":"4 - Rellenar los siguientes campos, ya que son heredados por los servicios que dependan de esta acometida Calibre Longitud Calibre de válvula Caudal Presión mínima garantizada Presión máxima alcanzable","data":"","result":"Se guardan los valores correctamente","attachments":[]},{"id":605,"index":5,"step":"5 - Buscar acometidas, utilizando filtros existentes, para encontrar la Acometida creada en el paso anterior.","data":"","result":"El sistema obtiene las acometidas que cumplen los criterios de busqueda definidos. Y los carga por ventana.","attachments":[]},{"id":606,"index":6,"step":"6 - Acceder al detalle de la acometida a partir de la entrada en la tabla maestro.","data":"","result":"Se muestra la acometida, se han generado los datos de acuerdo con los valores introducidos. En la pestaña histórico hay un valor inicial.","attachments":[]}]}}},{"id":222,"testExecKey":"TEST-457","testKey":"TEST-388","status":"EXECUTING","type":"Manual","start":"2018-08-08T14:24:44+02:00","executedBy":"clande","defects":[],"evidences":[],"steps":[{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]}],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1310 - Crear Servicio","customfield_12404":{"steps":[{"id":607,"index":1,"step":"1 - Seleccionar una acometida (puede ser la creada enteriormente) y acceder a su detalle. Dentro del detalle de la acometida, ir a la pestaña Servicios'","data":"","result":"Se muestra la pestaña Servicios de la Acometida, donde aparecen todos los servicios definidos para esa acometida.","attachments":[]},{"id":608,"index":2,"step":"2 - Hacer Añadir'para crear un nuevo servicio para la acometida.'","data":"","result":"Se abre la pestaña de detalle de Servicio. Donde se indican la dirección y los datos bàsicos de la acometida a la que pertenece.","attachments":[]},{"id":609,"index":3,"step":"3 - Completar los datos del Servicio, respetar valores para los campos siguientes: Tipo de servicio: Vivienda En la pestaña Contratación', marcar el campo 'Contratación posible' para poder contratar sin problemas. Hacer Aceptar.'","data":"","result":"Se crea el servicio de forma correcta. La pestaña servicios de la Acometida se actualizará con los datos del Servicio creado.","attachments":[]}]}}},{"id":223,"testExecKey":"TEST-457","testKey":"TEST-389","status":"FAIL","type":"Manual","start":"2018-08-08T14:24:47+02:00","finish":"2018-08-08T14:24:47+02:00","executedBy":"clande","defects":[],"evidences":[],"steps":[{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]},{"status":"TODO","defects":[],"evidences":[]}],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1320 - Crear Punto de Servicio","customfield_12404":{"steps":[{"id":610,"index":1,"step":"1 - Ir a OC > Contratación > Oficina técnica > Serivcios', y buscar servicios que cumplan las condiciones (Existe la opción de buscar el Servicio creado en el caso anterior).'","data":"","result":"Se muestra la ventana de maestro de servicios, y permite realizar la búsqueda según los criterios definidos.","attachments":[]},{"id":611,"index":2,"step":"2 - Seleccionar a un Servicio y acceder a su detalle.","data":"","result":"Se muestra el detalle del Servicio. (en caso que sea el creado en elPR anterior, revisar que los parámetros mostrados sean los introducidos).","attachments":[]},{"id":612,"index":3,"step":"3 - Ir a la pestaña Puntos de Servicio'para verificar los PS asociados al Servicio. Hacer 'Nuevo PS'para iniciar el proceso de creación de nuevos puntos de servicio.'","data":"","result":"Se muestra la ventana con los PS existentes para el PS. Al realizar la acción, se abre la ventana de creación de nuevos PS.","attachments":[]},{"id":613,"index":4,"step":"4 - Proceder a crear los PS En la pestaña Datos de Generación, seleccionar tipo de punto de servicio y forma de suministro. Seleccionar calibre del PS (diámetro de la tuberia) Seleccionar datos de las direcciones para los que se crearán los PS. Se pueden seleccionar bloques, portales, escaleras según letras... Completar el bloque Múltiple para indicar las plantas y puertas del edificio para las que se generaran PS de forma masiva. Hacer 'Generar puntos'para iniciar el proceso'","data":"","result":"Se crean los PS según criterios definidos. Se crearán tantos PS como combinaciones de puertas indicadas en la parametrización. El sistema te devuelve al detalle del Servicio, donde aparecen todos los PS, incluyendo los nuevos. Comprobar que la numeración de plantas y puertas es la correcta","attachments":[]},{"id":614,"index":5,"step":"5 - Repetir el paso anterior, pero utilizando la opción Puertas Numeradas. Donde se indicará el número de puertas por planta, puerta inicial-final y planta final.","data":"","result":"Se crean los nuevos PS. Uno para cada planta y piso por planta. Comprobar que la numeración de puertas es correlativa, no hace las combinaciones con plantas y puertas","attachments":[]},{"id":615,"index":6,"step":"6 - Acceder al detalle de alguno de los PS creados. Mediante el botón modificar de la tabla.","data":"","result":"El PS se ha creado según los datos introducidos en el proceso de creación.","attachments":[]}]}}},{"id":224,"testExecKey":"TEST-457","testKey":"TEST-390","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1330 - Crear Solicitud Acometida","customfield_12404":{"steps":[{"id":616,"index":1,"step":"1 - Ir a OC > Contratción > Oficina técnica > Solicitudes de acometia'y hacer 'Añadir'","data":"","result":"En primer lugar aparece la ventana maestra, que da paso a la pantalla de detalle de la solcitiud de acometida, cuando se da a añadir El sistema puede mostrar un paso intermedio de selección de explotación (esto es debido a que no tenemos seleccionada una sola explotación)","attachments":[]},{"id":617,"index":2,"step":"2 - Verificar que el mantenimiento de explotaciones (Datos maestros > Explotaciones > pestaña parámetros funcionales > campo gestor de órdenes) no debe poner GOT En la ventana de detalle, completar la cabecera de la ventana: Tipo solicitud Seleccionar una dirección de la población a la que corresponde la explotación. Completar los datos de dirección (finca, etc...). Completar los datos de las pestañas: Datos Generales. Donde será necesario indicar el peticionario e instalador. Utilizar personas dadas de alta en el sistema. Según el rol del peticionario será necesario introducir más o menos datos. Datos técnicos. Indicar usoy tipo instalación, e indicar que es definitiva. Aceptar para crear la solicitud","data":"","result":"El sistema crea la soclicitud y nos indica el número de solicitud que se le ha asignado.","attachments":[]},{"id":618,"index":3,"step":"3 - En la ventana maestro, buscar la solicitud a partir de su código. Y abir el detalle.","data":"","result":"El sistema encuentra la solicitud, cosa que permite abrir el detalle. Los datos del detalle son los que hemos introducido en el paso anterior.","attachments":[]},{"id":619,"index":4,"step":"4 - Registrar la documentación que debe aportar el cliente mediante el botón 'Registrar Doc a presentar.'","data":"","result":"En la ventana que se abre al darle al botón, marcar los documentos y aceptar.","attachments":[]},{"id":620,"index":5,"step":"5 - En la pestaña 'Órdenes', generar una orden de inspección mediante el botón 'Generar Orden inspección'. La inspección es necesaria para que el operario visite el punto donde se instalará la acometida.'","data":"","result":"Se genera una orden de inspección, que se puede visualizar, y se muestra en la tabla de órdenes.","attachments":[]},{"id":621,"index":6,"step":"6 - Generar una solicitud de aprobación, desde la pestaña 'Presentaciones'. (Puede no ser necesario).","data":"","result":"","attachments":[]},{"id":622,"index":7,"step":"7 - Comunicar al cliente el presupuesto de Acometida, mediante el botón Comunicar al cliente'","data":"","result":"El sistema notifica que se ha comunicado al cliente, y cambia el estado de la Solicitud.","attachments":[]},{"id":623,"index":8,"step":"8 - Indicar que el cliente a aceptado el presupuesto, mediante el botón 'Aceptación del cliente'","data":"","result":"El sistema avisa que ha realizado la aceptación y cambia el estado de la solicitud a 'Aceptada'.","attachments":[]},{"id":624,"index":9,"step":"9 - Crear la acometida mediante el botón 'Crear Acometida'","data":"","result":"Esta opción abre la ventana de detalle de la acometida, con los datos de situación y los informados.","attachments":[]},{"id":625,"index":10,"step":"10 - Completar los datos de la acometida, y aceptar.","data":"","result":"Se crea la acometida.","attachments":[]},{"id":626,"index":11,"step":"11 - Crear orden de instalación de la acometida, para que se cree fisicamente. Para ello ir a la pestaña de órdenes y hacer 'Generar orden instalación'.","data":"","result":"Se crea la orden de instalación que puede ser visualizada.","attachments":[]},{"id":627,"index":12,"step":"12 - Antes de certificar la creación, se debe imprimir la orden que se acaba de realizar Para certificar la orden, el usuario debe tener permisos. Mirar los perfiles que tiene asignado el usuario en Operativa sistema > gestión de usuarios > pestaña perfiles Una vez se sabe los perfiles del usuario ir a datos maestros > datos maestros órdenes > tipos de orden > en la tabla perfiles autorizados verificar que el perfil está en ella","data":"","result":"Impresión de la orden de instalación El perfil del usuario debe tener permiso para certificar este tipo de órdenes","attachments":[]},{"id":628,"index":13,"step":"13 - Para que la creación de la Acometida, sea efectiva, hay que certificarla. para ello ir a OC > Gesión ordenes de servicio > Certificador de ordenes'y certificar la orden de instalación de acometida.'","data":"","result":"El sistema certifica la orden a partir de los datos introducidos. Creando así la acometida.","attachments":[]}]}}},{"id":225,"testExecKey":"TEST-457","testKey":"TEST-391","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1400 - Crear explotación","customfield_12404":{"steps":[{"id":629,"index":1,"step":"1 - Ir a Datos maestros > explotaciones'","data":"","result":"Se muestra el maestro de explotaciones.","attachments":[]},{"id":630,"index":2,"step":"2 - Buscar un código de 4 cifras no utilizado a partir de los valores del maestro, y hacer añadir, para crear una nueva explotación.","data":"","result":"Aparece el detalle de la explotación, vacio con los campos obligatorios marcados en azul.","attachments":[]},{"id":631,"index":3,"step":"3 - Introducir los campos obligatorios de la explotación: Identificador númerico, nombre de la explotación. Sociedad (empresa gestora), a partir del buscador. Descripción Datos de contacto Unidad de protección de datos genérica (SI LOPD activa) En Lecturas: número de estimaciones máximas, número períodos sin lecturas, estimar después de n leidos. En cartera: número de plazos, días de vencimientos de plazo, dias vencimiento gestión, Emisión de remesa, Devoluciones bancarias, tratamientos ventanilla En contabilidad: Código explotación contable, centro beneficio En Comunicaciones: última notificación, formato fecha carta cambio contador, formato contratante en contrato En parámetros funcionales: Referencia para cambios de contador por edad Seleccionar localidades, oficinas e idiomas.","data":"","result":"Se crea la nueva explotación.","attachments":[]},{"id":632,"index":4,"step":"4 - Dar permiso al usuario para acceder a la explotación Operativa comercial > gestión de usuario > usuario","data":"","result":"ver datos de la explotación creada","attachments":[]},{"id":633,"index":5,"step":"5 - Verificar a nivel de maestro que se ha creado la nueva explotación. Mediante una búsqueda a partir de filtro por código o nombre. Acceder al detalle de la explotación.","data":"","result":"La explotación aparece en la lista del maestro. A nivel de detalle se muestran los datos de forma correcta.","attachments":[]}]}}},{"id":226,"testExecKey":"TEST-457","testKey":"TEST-392","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1410 - Copiar explotación","customfield_12404":{"steps":[{"id":634,"index":1,"step":"1 - Ir a Datos maestros > Explotaciones'. Hacer una busqueda, seleccionar la explotación a copiar en la tabla y en el campo asociado al botón 'copiar explotación', indicar un número de explotación que esté disponible. Hacer 'Copiar Explotación'","data":"","result":"El sistema inicia la cópia de la explotación. El sistema abre el detalle de la nueva explotación, con el código que hemos indicado introducido y los campos cópiados del entorno original registrados.","attachments":[]},{"id":635,"index":2,"step":"2 - Dar permiso al usuario para acceder a la explotación Operativa comercial > gestión de usuario > usuario","data":"","result":"ver datos de la explotación creada","attachments":[]},{"id":636,"index":3,"step":"3 - Verificar que los datos introducidos són correctos. Y añadir los faltantes. Aceptar","data":"","result":"Se crea la explotación, a partir de los datos copiados + los introducidos.","attachments":[]}]}}},{"id":227,"testExecKey":"TEST-457","testKey":"TEST-393","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1500 - CAT: Contratación","customfield_12404":{"steps":[{"id":637,"index":1,"step":"1 - Elegir punto de servicio Elegir persona Introducir señas de cobro a la persona Botón documentación Verificar asignación de variables al tipo de contratación elegida Facturar alta Cobrar la factura de alta en metálico","data":"","result":"Se debe imprimir las facturas de alta Se debe imprimir los documento de contrato Se debe imprimir el documento SEPA (en caso de que sea una domiciliación bancaria el tipo de señas de cobro) Si la explotación no está conectada a GOT, debe imprimir la orden de instalación del contador","attachments":[]},{"id":638,"index":2,"step":"2 - Certificar la orden de instalación de contador: Si la explotación está conectada con GOT, hacer lospasos necesariodesde GOT y después desde la certificación de CF Si la explotación no está conectada con GOT, hacerlo desde la certificación de órdenes de CF Elegir cógido de recorrido de facturación Verificar el código de recorrido","data":"","result":"Verificar que después de la certificación el contrato ha pasado de pendiente de contratar a alta Verificar que el punto de servicio, tiene como contrato asociado el contrato que se acaba de dar de alta","attachments":[]}]}}},{"id":228,"testExecKey":"TEST-457","testKey":"TEST-394","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1510 - CAT: Acceder detalle contrato","customfield_12404":{"steps":[{"id":639,"index":1,"step":"1 - Realizar una modificación a un contrato","data":"","result":"Se visualizará un contato que se debe informar y aceptar","attachments":[]},{"id":640,"index":2,"step":"2 - Visualizar el contrato modificado anteriormente","data":"","result":"Verificar que las modificaciones han sido actualizadas Se genera automáticamente un contacto que se debe infprmar y aceptar","attachments":[]}]}}},{"id":229,"testExecKey":"TEST-457","testKey":"TEST-395","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1600 - Contratación (ordinaria)","customfield_12404":{"steps":[{"id":641,"index":1,"step":"1 - Ir a OC > Contratación > Proceso de contratación > Contratación'","data":"","result":"Se muestra la ventana inicial del proceso de contratatación","attachments":[]},{"id":642,"index":2,"step":"2 - Mediante el selector, escoger un punto de servicio entre los disponibles. Se recomienda que sea de tipo Vivienda para contratación doméstica y en estado PENDIENTE o BAJA para simplificar el proceso.","data":"","result":"Se añade el PS a la selección","attachments":[]},{"id":643,"index":3,"step":"3 - En la opción para el cliente, estará solo disponible la opción otro'. Hacer seleccionar, para indicar la Persona. Y en el maestro de persona, hacer añadir para crear una nueva persona'","data":"","result":"Se abre el detalle de persona","attachments":[]},{"id":644,"index":4,"step":"4 - Completar los datos de la persona: Nombre y apellidos: Si es Jurídica, completar sólo apellido1 DNI o CIF. En la pestaña Señas de cobro introducir una nueva seña de cobro (bancaria o no bancaria). Hacer aceptar para completar la introducción de la persona.","data":"","result":"Se crea la nueva persona, que queda registrada en el formulario de la contratación.","attachments":[]},{"id":645,"index":5,"step":"5 - Hacer Contratar'para iniciar el proceso de contratación'","data":"","result":"El sistema inicia la contratación, llevando al usuario al paso de contratación'","attachments":[]},{"id":646,"index":6,"step":"6 - En el paso de contratación, indicar: Tipo de contratación: Alta Doméstica o Alta Procede de Baja / Doméstica Y presentar documentación Hacer Aceptar para continuar","data":"","result":"Se registran los datos","attachments":[]},{"id":647,"index":7,"step":"7 - En el paso Alta de contrato', indicar: Datos del contador. Definir contrato, con elementos propios Hacer Aceptar para continuar'","data":"","result":"Se registran los datos","attachments":[]},{"id":648,"index":8,"step":"8 - En el Detalle del contrato', indicar: Seleccionar alguna de las señas de cobro procedentes de la persona. Otros campos de la persona que sean imcompletos (p.ej NIF). Hacer Aceptar para continuar'","data":"","result":"Se registran los datos.","attachments":[]},{"id":649,"index":9,"step":"9 - En Seleccion de conceptos'. Verificar correcta asignación de las variables en los tipos de contratación Hacer Aceptar para continuar'","data":"","result":"Se registran los datos.","attachments":[]},{"id":650,"index":10,"step":"10 - En Definición de cláusulas', hacer aceptar para continuar.'","data":"","result":"Se registran los datos","attachments":[]},{"id":651,"index":11,"step":"11 - Al volver a la ventana de Alta de Contrato', hacer 'Facturar contratación'para proceder a facturar al cliente el coste del alta.'","data":"","result":"Se abrirá el detalle de la Factura.","attachments":[]},{"id":652,"index":12,"step":"12 - Revisar los datos de las facturas, y aceptar tanto enla factura como en las líneas de factura.","data":"","result":"Se registran los datos de la factura. Finalmente se mostrará un mensaje indicando el importe total de la factura de alta. Donde se indicará que Sí para dar la factura por definitiva.","attachments":[]},{"id":653,"index":13,"step":"13 - En la ventana de Alta de Contrato', hacer 'Aceptar'para finalizar con el Alta.'","data":"","result":"Se registra el alta, y pasa al paso de cobrar el importe de la factura de Alta.","attachments":[]},{"id":654,"index":14,"step":"14 - En la ventana de Cobro, proceder a realizar Cobro de la factura de alta en metálico (OFICINA) (esto se consigue clicando el botón añadir cobro') y confirmar en los distintos pasos.'","data":"","result":"Se cobra el importe de la factura, finalizando la Contratación. Como paso final se mostrará un mensaje de confirmación: Y se termina emitiendo la documentación correspondiente en PDF. La documentacion debe estar de acuerdo, con los pasos anteriores.","attachments":[]},{"id":655,"index":15,"step":"15 - Pasos posteriores: Antes de certificar la creación, se debe imprimir la orden que se acaba de realizar Para certificar la orden, el usuario debe tener permisos. Mirar los perfiles que tiene asignado el usuario en Operativa sistema > gestión de usuarios > pestaña perfiles Una vez se sabe los perfiles del usuario ir a datos maesteos > datos maestros órdenes > tipos de orden > en la tabla perfiles autorizados certificar que el perfil está en ella Verificar que la explotación tiene el gestor de ordenes informado Datos maestros > explotaciones > pestaña parámetros funcionales Ir a OC > Gestion de ordenes > Certificador de ordenes'","data":"","result":"Para confirmar la contratación y certificar la posible orden de instalación del contador.","attachments":[]},{"id":656,"index":16,"step":"16 - Ir a OC > Contratación > Proceso de contratación > Contratos'y en el maestro de contratos buscar el contrato que se acaba de crear. Acceder al detalle'","data":"","result":"Comprovar que se ha creado el contrato, a partir de los datos introducidos.","attachments":[]},{"id":657,"index":17,"step":"17 - Dar de alta una contrato en una explotación que tenga GOT","data":"","result":"Realizar todos los procesos de GOT, hasta que en CF esté la OT realizada, acabar la certificación en CF","attachments":[]}]}}},{"id":230,"testExecKey":"TEST-457","testKey":"TEST-396","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1610 - Acceder detalle contrato NO CAT","customfield_12404":{"steps":[{"id":658,"index":1,"step":"1 - Realizar una modificacion al contrato","data":"","result":"Visualizar el contrato verificando que la modificación se ha realizado correctamente","attachments":[]}]}}},{"id":231,"testExecKey":"TEST-457","testKey":"TEST-397","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1620 - A¤adir contacto manual","customfield_12404":{"steps":[{"id":659,"index":1,"step":"1 - Ir a OC > Contratación > Procesos de contratación > Contratos', buscar un contrato de alta y acceder a su detalle'","data":"","result":"Se muestra el detalle del contrato","attachments":[]},{"id":660,"index":2,"step":"2 - En el detalle del contrato, hacer H. Contactos'para abrir la ventana que recopila los contactos que se realizan con el cliente.'","data":"","result":"Se muestra la ventana de contactos, en la primera pestaña, veremos las veces que la empresa de aguas ha contactado con el cliente. El resto de pestaña contienen las comunicaciones (no periódicas) que se han mandado al cliente.","attachments":[]},{"id":661,"index":3,"step":"3 - Hacer añdadir para introducir un nuevo contacto con el cliente.","data":"","result":"Se muestra la ventana de detalle del nuevo contacto, con el formulario listo para introducir datos.","attachments":[]},{"id":662,"index":4,"step":"4 - Introducir los datos obligatorios del contacto: Tipo, vía de comunicación, motivo Seleccionar una persona de origen del contacto, utilizando los combo-boxes y los selectores de persona. Añadir un mensajeu observación Hacer Aceptar'para introducir el contacto'","data":"","result":"Se introduce el contacto y queda reflejado en la lista de contactos del cliente.","attachments":[]}]}}},{"id":232,"testExecKey":"TEST-457","testKey":"TEST-398","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1630 - Contratación: Cambio de nombre","customfield_12404":{"steps":[{"id":663,"index":1,"step":"1 - Ir a OC > Contratación > Proceso de contratación > Contratación'","data":"","result":"Se muestra la ventana inicial del proceso de contratatación","attachments":[]},{"id":664,"index":2,"step":"2 - Mediante el selector, escoger un punto de servicio entre los disponibles. Se recomienda que sea de tipo Vivienda para contratación domestica y en estado CONTRATADO.","data":"","result":"Se añade el PS a la selección. En la sección para seleccionar la persona, aparece por defecto la opción OTRO.","attachments":[]},{"id":665,"index":3,"step":"3 - En la opción para el cliente, estará disponible la opción otro'. Hacer seleccionar, para indicar la Persona. En el maestro de persona, seleccionar una persona que no tenga relación con el PS (y contrato) seleccionados.'","data":"","result":"Se añade la persona a la selección.","attachments":[]},{"id":666,"index":4,"step":"4 - Hacer Contratar'para iniciar el proceso de contratación'","data":"","result":"El sistema inicia la contratación, llevando al usuario al paso de contratación'","attachments":[]},{"id":667,"index":5,"step":"5 - En el paso de contratación, indicar: Tipo de contratación, del tipo CAMBIO NOMBRE a XXXXX Y presentar documentación Hacer Aceptar para continuar","data":"","result":"Se registran los datos","attachments":[]},{"id":668,"index":6,"step":"6 - En el paso Baja del Contrato'introduciremos los datos de finalización del contrato anterior: Insertar una lectura, origen y observación de lectura para la Esfera 1 del bloque 'Inserción de Lectura Manual' Hacer 'Insertar lectura', para que se registre la lectura. (nota: insertar una lectura de acuerdo con la última registrada en el sistema).'","data":"","result":"El sistema indica que se añadirá lectura, indicando un consumo coherente con los datos introducidos. Se recargará la tabla con los datos de lecturas, de acuerdo con el valor introducido.","attachments":[]},{"id":669,"index":7,"step":"7 - Dentro del paso Baja de contrato', producir a facturar la baja del mismo. Hacer 'Facturar Baja'para que se genere la factura de baja. Posteriormente, 'Aceptar'para continuar con el proceso. '","data":"","result":"Se creará la fatura de baja, pudiéndose visualizar el importe de la misma. Además, mediante el botón Facturación'se puede acceder al detalle de la facturación de baja. Nota: En algunos casos puede ser necesario entrar a la facturación para ver los mensajes que se hayan podido generar.'","attachments":[]},{"id":670,"index":8,"step":"8 - En el paso Alta de contrato', indicar: Datos del contador. Definir contrato, con elementos propios Hacer Aceptar para continuar'","data":"","result":"Se registran los datos","attachments":[]},{"id":671,"index":9,"step":"9 - En el Detalle del contrato', indicar: Seleccionar alguna de las señas de cobro procedentes de la persona. Otros campos de la persona que sean imcompletos (p.ej NIF). Hacer Aceptar para continuar'","data":"","result":"Se registran los datos.","attachments":[]},{"id":672,"index":10,"step":"10 - En Seleccion de conceptos'. Verificar lacorrecta asignación de las variables en los tipos de contratación Hacer Aceptar para continuar'","data":"","result":"Se registran los datos.","attachments":[]},{"id":673,"index":11,"step":"11 - En Definición de cláusulas', hacer aceptar para continuar.'","data":"","result":"Se registran los datos","attachments":[]},{"id":674,"index":12,"step":"12 - Al volver a la ventana de Alta de Contrato', hacer 'Facturar'para proceder a facturar al cliente el coste del alta.'","data":"","result":"Se abrirá el detalle de la Factura.","attachments":[]},{"id":675,"index":13,"step":"13 - Revisar los datos de las facturas, y aceptar tanto enla factura como en las líneas de factura.","data":"","result":"Se registran los datos de la factura. Finalmente se mostrará un mensaje indicando el importe total de la factura de alta. Donde se indicará que Sí para dar la factura por definitiva.","attachments":[]},{"id":676,"index":14,"step":"14 - En la ventana de Alta de Contrato', hacer 'Aceptar'para finalizar con el Alta.'","data":"","result":"Se registra el alta, y pasa al paso de cobrar el importe de la factura de Alta.","attachments":[]},{"id":677,"index":15,"step":"15 - En la ventana de Cobro, procesder a realizar Cobro de la factura de alta en metálico (OFICINA) y confirmar en los distintos pasos.","data":"","result":"Se cobra el importe de la factura, finalizando la Contratación. Como paso final se mostrará un mensaje de confirmación de la transacción de cambio de nombre. Y se termina emitiendo la documentación correspondiente en PDF. La documentacion debe estar de acuerdo, con los pasos anteriores.","attachments":[]},{"id":678,"index":16,"step":"16 - Pasos posteriores: Ir a OC > Contratación > Proceso de contratación > Proceso de contratación', realizar búsqueda por fecha. Acceder al detalle del proceso de contratación y hacer 'Finalizar'.'","data":"","result":"Para confirmar la contratación y certificar la posible orden de instalación del contador.","attachments":[]},{"id":679,"index":17,"step":"17 - Ir a OC > Contratación > Proceso de contratación > Contratos'y en el maestro de contratos buscar el contrato que se acaba de crear. Acceder al detalle'","data":"","result":"Comprovar que se ha creado el contrato, a partir de los datos introducidos.","attachments":[]}]}}},{"id":233,"testExecKey":"TEST-457","testKey":"TEST-399","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1640 - Contratación: BAJA","customfield_12404":{"steps":[{"id":680,"index":1,"step":"1 - Ir a OC > Contratación > Proceso de contratación > Contratación'","data":"","result":"Se muestra la ventana inicial del proceso de contratatación","attachments":[]},{"id":681,"index":2,"step":"2 - Mediante el selector, escoger un punto de servicio entre los disponibles. Se recomienda que sea de tipo Vivienda para contratación doméstica y en estado CONTRATADO.","data":"","result":"Se añade el PS a la selección. En la sección para seleccionar la persona, aparece por defecto la opción OTRO.","attachments":[]},{"id":682,"index":3,"step":"3 - En la opción para el cliente, estará disponible la opción otro'. Marcar la opción Cliente. '","data":"","result":"Automáticamente se cargan los datos de la persona registrada cómo cliente del contrato.","attachments":[]},{"id":683,"index":4,"step":"4 - Hacer BAJA'para iniciar el proceso de Baja del contrato'","data":"","result":"El sistema inicia la contratación, llevando al usuario al paso de contratación'","attachments":[]},{"id":684,"index":5,"step":"5 - En el paso de contratación, indicar: Tipo de contratación, del tipo BAJA a XXXXX Y presentar documentación Hacer Aceptar para continuar","data":"","result":"Se registran los datos","attachments":[]},{"id":685,"index":6,"step":"6 - En el paso Baja del Contrato'introduciremos los datos de finalización del contrato anterior: Seleccionar un motivo de la baja Insertar una lectura, origen y observación de lectura para la Esfera 1 del bloque 'Inserción de Lectura Manual' Hacer 'Insertar lectura', para que se registre la lectura. (nota: insertar una lectura de acuerdo con la última registrada en el sistema).'","data":"","result":"El sistema indica que se añadirá lectura, indicando un consumo coherente con los datos introducidos. El sistema puede lanzar un aviso, en caso de que la lectura no esté dentro de los rangos esperados según el historial de consumo del mismo. Se recargará la tabla con los datos de lecturas, de acuerdo con el valor introducido.","attachments":[]},{"id":686,"index":7,"step":"7 - Dentro del paso Baja de contrato', producir a facturar la baja del mismo. Hacer 'Facturar Baja'para que se genere la factura de baja. Posteriormente, 'Aceptar'para continuar con el proceso. '","data":"","result":"Se creará la factura de baja, pudiéndose visualizar el importe de la misma. Además, mediante el botón Facturación'se puede acceder al detalle de la facturación de baja. Nota: En algunos casos puede ser necesario entrar a la facturación para ver mensajes que se hayan podido generar.'","attachments":[]},{"id":687,"index":8,"step":"8 - En la ventana de Cobro, proceder a realizar Cobro de la factura de baja en metálico (OFICINA) (esto se consigue clicando el botón añadir cobro') y confirmar en los distintos pasos.'","data":"","result":"Se cobra el importe de la factura, finalizando la Contratación. Como paso final se mostrará un mensaje de confirmación de la transacción de baja. Y se termina emitiendo la documentación correspondiente en PDF. La documentacion debe estar de acuerdo, con los pasos anteriores.","attachments":[]},{"id":688,"index":9,"step":"9 - Pasos posteriores: Ir a OC > Gestión de órdenes de servicio > Certificador de Órdenes'En la pestaña 'Certificador individual'proceder a certificar la orden asociada a la retirada del contador, que se ha generado durante la baja. Introducir una fecha/hora de visita y un contratista e operario. Hacer Certificar. En caso de no conocer el ID de Orden, dentro del mismo nivel de menú, consultar la entrada Órdenes, donde se puede buscar por ID de Contrato.'","data":"","result":"Se certifica la orden de retirada del contador y se da por finalizada la baja.","attachments":[]},{"id":689,"index":10,"step":"10 - Actualizar contadores Insertar lectura y facturar botón certificar","data":"","result":"","attachments":[]},{"id":690,"index":11,"step":"11 - Ir a OC > Contratación > Proceso de contratación > Contratos'y en el maestro de contratos buscar el contrato que se acaba de dar de baja. Acceder al detalle'","data":"","result":"Comprobar que se ha dado de baja el contrato, a partir de los datos introducidos.","attachments":[]},{"id":691,"index":12,"step":"12 - Dar de baja un contrato de una explotación que tenga GOT","data":"","result":"Realizar todos los procesos de GOT, hasta que en CF esté la OT realizada, acabar la certificación en CF","attachments":[]}]}}},{"id":234,"testExecKey":"TEST-457","testKey":"TEST-400","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1700 - Crear lotes Periódicos","customfield_12404":{"steps":[{"id":692,"index":1,"step":"1 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Lotes de lectura'En la pantalla maestra, seleccionar la pestaña 'Lotes de lectura'","data":"","result":"Se muestra la pestaña de lotes de lectura, donde aparecen los lotes de lectura en función de ser creados, según calendarización de las zonas.","attachments":[]},{"id":693,"index":2,"step":"2 - Seleccionar una zona, y hacer Crear lotes para la zona seleccionada'","data":"","result":"El sistema muestra una ventana con las libretas de la zona que están en condiciones de que se creen sus lotes.","attachments":[]},{"id":694,"index":3,"step":"3 - Seleccionar una Libreta y hacer aceptar para crear los lotes de lectura de esta libreta.","data":"","result":"Aparecerá un mensaje de confirmación con la libreta y el período de lectura para el que se crearán los lotes de lectura. Al aceptar, se procederán a crear los lotes para esta libreta. Al finalizar, aparece un desglose de los lotes creado a partir de los PS que están Contratados de la Libreta (tener en cuenta que el número de lotes creados depende de diversos parámetros).","attachments":[]},{"id":695,"index":4,"step":"4 - Aceptar, para completar la creación de los lotes.","data":"","result":"Al Aceptar aparece un mensaje de confirmación, que debe ser aceptado para continuar con el proceso. Se crearán los lotes de lectura y se generarán archivos PDF con información de los lotes creados.","attachments":[]},{"id":696,"index":5,"step":"5 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Gestión de lotes de lectura'.'","data":"","result":"En el bloque Lotes pendientes'deben aparecer los lotes de lectura generados.'","attachments":[]},{"id":697,"index":6,"step":"6 - 1- Seleccionar el lote del panel pendiente y pulsar emitir 2- Añadir los datos siguientes y pulsar aceptar: - Fecha y hora de lectura - Diferencia entre lecturas - Operario 3- Seleccionar el lote del panel soporte procesados y pulsar el botón grabar lotes 4- Seleccionar el lote del panel soportes grabados y pulsar el botón actualizar","data":"","result":"1- Confirmar que se desea simular las lecturas, aparecerá la ventama de parámetros de simulación de lecturas para lote 2- El lote pasa al panel de soportes procesados 3- El lote se graba correctamente y pasa al panel de lotes grabados 4- El lote se actualiza correctamente","attachments":[]}]}}},{"id":235,"testExecKey":"TEST-457","testKey":"TEST-401","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1710 - Emisión de lotes de lectura","customfield_12404":{"steps":[{"id":698,"index":1,"step":"1 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Gestión de lotes de lectura","data":"","result":"Se muestra la ventana de Gestión de lotes","attachments":[]},{"id":699,"index":2,"step":"2 - Seleccionar un lote de lectura del panel de lotes pendientes y pulsar sobre el botón emitir","data":"","result":"Se emite correctamente el lote de lectura y aparece en el panel de lotes emitidos y en el panel de soportes procesados","attachments":[]},{"id":700,"index":3,"step":"3 - Ir a la carpeta de red donde se ha emitido el lote. Dentro de la carpeta. Ej:[<a href='file://\\\\Srvabswas2\\APLICACIONES_QA\\OCCAM_LOTES\\5120\\LotesDesarrollo\\Entrada'>OCCAM_LOTES\\5120\\LotesDesarrollo\\Entrada</a>]. Abrir lote con algún procesador de texto.","data":"","result":"El número de lineas tiene que coincidira con las laecturas totales del lote. Para saber las lecturas totales son las lectura sin grabar + los puntos de suministros de la pestaña sin lecturas'del lote.'","attachments":[]}]}}},{"id":236,"testExecKey":"TEST-457","testKey":"TEST-402","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1720 - Actualizar lote de lectura","customfield_12404":{"steps":[{"id":701,"index":1,"step":"1 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Gestión de lotes de lecturas","data":"","result":"Se muestra la ventana de Gestión de lotes.","attachments":[]},{"id":702,"index":2,"step":"2 - Seleccionar un lote de lectura del panel de soportes procesados y dar al botón registrar lotes","data":"","result":"Se registra correctamente y aparece en el panel de lotes registrados","attachments":[]},{"id":703,"index":3,"step":"3 - Selecciona el lote de lectura del panel de lotesgrabados y dar al botón actualizar","data":"","result":"Se actualiza correctamente el lote de lectura","attachments":[]}]}}},{"id":237,"testExecKey":"TEST-457","testKey":"TEST-403","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1730 - Revisión de lotes - Verificación de lecturas","customfield_12404":{"steps":[{"id":704,"index":1,"step":"1 - Ir a Operativa comercial > gestión de lecturas > procesos de lecturas > ajustes y cierres de lecturas > verificación de lecturas","data":"","result":"Se abre la pantalla de verificación con dos paneles: el de explotaciones con lecturas y el de detalle de lecturas por motivo","attachments":[]},{"id":705,"index":2,"step":"2 - 1- Seleccionar del panel de explotación una línea que en la columnas por revisar tenga un número mayor a 0 2- Seleccionar del panel de detalle por motivo una línea que en el valor de la columna pendiente de revisar sea mayor a 0 y dar al botón revisar","data":"","result":"1- La línea seleccionada debe aparecer en el panel de detalle por motivo 2- Se abre la pantalla de verificación de lecturas con todos los registros de las lecturas con la incidencia seleccionada anteriormente","attachments":[]},{"id":706,"index":3,"step":"3 - OJO con el campo Periodos no leidos, si tiene información no muestra ninguna lectura, es conveniente quitar el valor de este campo Seleccionar un contador con lectura a repasar del panel superior","data":"","result":"En el panel de lecturas muestra el histórico de lecturas de este contador","attachments":[]},{"id":707,"index":4,"step":"4 - Opción crear inspección: 1- Del panel de de lecturas seleccionar un contrato una lectura a la cual vamos a crear la inspección Dar al botón crear inspección 2- En la pantalla de detalle de la petición de inspección, seleccionar el periodo que se quiere inspeccionar y dar al botón aceptar 3- Ir a Operativa comercial > gestión de lecturas > proceso de lecturas > toma y gestión de lecturas > lotes de lectura > pestaña crear lotes de inspección y buscar por la zona a la que pertenecen los contratos a los que hemos creado la inspección","data":"","result":"1- Mostrará la pantalla del detalle de la petición de inspección 2- Automáticamente vuelve a la pantalla de verificación de lecturas Verificar que en esta pantalla (con el botón sin revisar pulsado) ha desaparecido el contrato al que acabamos de hacerle la inspección 3- Debe mostrar los contratos con el estado de inspección pendiente","attachments":[]},{"id":708,"index":5,"step":"5 - Opción Modificar: 1- Botón corregir 2- Seleccionar el periodo al que vamos a modificar 3- Modificar la lectura y añadir una nota de lectura, para salvar las modificaciones botón añadir 4- Automáticamente vuelve a la pantalla de verificación de lecturas","data":"","result":"1- Se abre la pantalla de insercción de lecturas manuales 2- En la parte inferior de la pantalla se rellenan los campos con los valores del periodo seleccionado 3- Sale un mensaje informativo en el que nos informa de que se ha añadido una lectura manual al periodo Aceptar En la tabla superior se muestra el periodo que acabamos de modificar en rojo y con la lectura y la Observación introducida por nosotros 4- En el panel de lecturas nos muestra la línea modificada en rojo","attachments":[]},{"id":709,"index":6,"step":"6 - Opción Mensaje y carta: 1- Seleccionar el contrato 2- Botón mensaje y carta 3- Informar el tipo de mensaje y el tipo de carta (Consumo excesivo y Carta de fuga) 4- Aceptar 5- Automáticamente vuelve a la pantalla de verificación de lecturas 6- Operativa comercial > comunicaciones > procesos de comunicación buscar la carta de tipo de comunicación = Carta de fuga que acabamos de realizar 7- Botón imprimir cartas 8- Entramos a la comunicación > pestaña cartas > entrar en la línea de la carta > desde el detalle de la carta dar al botón Volver a crear","data":"","result":"1- Tomar nota del número del contrato 2- Se abre la pantalla mensaje y carta 4- Informa de que el mensaje y la carta se han generado sastisfactoriamente 5- El contrato desaparece de la pantalla de verificación de lecturas: detalle de zona 7- El estado de la comunicación debe ser finalizado 8- Nos mostrará por pantalla la carta de fuga. Verificar que los datos sean correctos","attachments":[]}]}}},{"id":238,"testExecKey":"TEST-457","testKey":"TEST-404","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1740 - Estimación Libretas","customfield_12404":{"steps":[{"id":710,"index":1,"step":"1 - Verificar que la explotación tiene dada de alta los métodos de estimación para tipo de estimación NO LEIDOS'(Datos maestros > explotaciones > pestaña lecturas > pestaña métodos de estimación) 1) Ir a OC > Gestión de lecturas > Proceso de lecturas > Ajustes y cierre de lecturas > Estimación de no leídos. 2) Seleccionar una zona del panel 'Zonas listas para estimación'. 3) Seleccionar una libreta del panel 'Libretas disponibles'y pulsar en el botón Estimar libretas seleccionadas'","data":"","result":"1) Se abre la ventana de estimación de no leídos. 2) Se muestran las libretas que se pueden estimar en el panel Libretas disponibles'. 3) Se realiza correctamente la estimación.'","attachments":[]}]}}},{"id":239,"testExecKey":"TEST-457","testKey":"TEST-405","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1750 - Cierre del ciclo de lecturas","customfield_12404":{"steps":[{"id":711,"index":1,"step":"1 - 1) Ir a OC > Gestión de lecturas > Proceso de lecturas > Ajustes y cierre de lecturas > Cierre del ciclo de lecturas. 2) Seleccionar una zona de las disponibles y pulsar sobre el botón Cerrar zona seleccionada","data":"","result":"1) Se abre la ventana Estimación y cierre del ciclo de lecturas. 2) Se cierra el ciclo de lecturas correctamente. La zona pasa de estadoCICLO EN CURSOaCICLO PENDIENTE se puede verificar desde datos maestros > datos maestros comercial > datos maestros lecturas > zonas","attachments":[]}]}}},{"id":240,"testExecKey":"TEST-457","testKey":"TEST-406","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1760 - Crear lotes no periódicos","customfield_12404":{"steps":[{"id":712,"index":1,"step":"1 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Lotes de lectura'En la pantalla maestra, seleccionar la pestaña 'Crear lotes no periódicos'","data":"","result":"Se muestra la pestaña de datos de peticiónde la pantalla de creación de lotes no periódicos.","attachments":[]},{"id":713,"index":2,"step":"2 - Realizar un proceso de selección de datos. Los datos seleccionados deberán corresponder siempre a puntos de zonas en estado CICLO PENDIENTE. El alcance: Todas las zonas con la periodicidad indicada. Seleccionar por zonasindividuales Criterios adicionales de búsqueda: Por actividades, categoria del contrato, tipo de suministro Además se puede parametrizar la inclusión de puntos por telectura o el número máximo de puntos por lote. Crear los lotes haciendo Crear lotes no periódicos para la Zona(s) seleccionada(s)'","data":"","result":"El sistema indica las zonas y el número de ciclo para las que se procederán a crear los lotes de lectura. Acción que se deberá confirmar. A continuación aparecerá la lista de lotes que se crearán.","attachments":[]},{"id":714,"index":3,"step":"3 - Pulsar sobre el botón Crear lotes no periódicos para la(s) zona(s) seleccionada(s)","data":"","result":"El sistema indicará que los lotes se completarán y serán creados definitivamente. Aceptar para continuar. Se generarán informes en formato PDF con los lotes creados Finalmente, se muestra un mensaje indicando que se han creado los lotes con éxito.","attachments":[]},{"id":715,"index":4,"step":"4 - Ir a OC > Gestión de lecturas > Proceso de lecturas > Toma y gestión de lecturas > Gestión de lotes de lectura'y verificar que los lotes creados aparecen en estado pendiente'","data":"","result":"En el panelLotes PENDIENTES aparecen los lotes creados en los pasos anteriores.","attachments":[]},{"id":716,"index":5,"step":"5 - 1) Seleccionar un lote no periódico del panel Lotes PENDIENTES y pulsamos sobre el botón Emitir. 2) Añadimos los siguientes datos y pulsamos Aceptar. Fecha y hora de lectura. Diferencia entre lecturas (Cualquier valor) Operario. 3) Seleccionar el lote del panel Soportes PROCESADOS y pulsar sobre el botón Grabar lotes.","data":"","result":"1) Tras confirmar que deseamos simular las lecturas aparece la ventana de Parámetros de simulación de lecturas para lote. 2) El lote pasa al panel de Soportes Procesados. 3) El lote se graba correctamente. El lote pasa al panel Lotes GRABADOS.","attachments":[]},{"id":717,"index":6,"step":"6 - Seleccionar el lote del panellotes GRABADOS y pulsar sobre el botón lote 1) Pestaña lecturas: seleccionar un contrato y modificar la lectura, también añadir una observación, botón Modificar lectura Botón cerrar 2) Una vez estemos en lotes registrados pulsar sobre el botón Actualizar","data":"","result":"1) Comprobar que se ha cambiado la lectura y se asocia a la observación. 2) El lote se actualiza correctamente.","attachments":[]}]}}},{"id":241,"testExecKey":"TEST-457","testKey":"TEST-407","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1770 - Crear lotes de Inspección","customfield_12404":{"steps":[{"id":718,"index":1,"step":"1 - Escoger una explotación (desde la selección de explotaciones) que su código de explotación esté dado de alta como carpeta en la ubicación dada de alta en el servidor utilizado (<a href='file://\\\\servidor\\APLICACIONES_QA_OCCAM_LOTES'>\\\\servidor\\APLICACIONES_QA_OCCAM_LOTES</a>). Por ejemplo: si se elige la explotación 1446 La Jonquera, debe estar creada la carpeta 1446 en la ubicación descrita anteriormente. En el caso de que no exista, crearla antes de hacer la prueba Ir a OC > Gestión de lecturas > Proceso de lecturas > Ajuste y cierre de lecturas > Verificación de lecturas'","data":"","result":"Paso previo","attachments":[]},{"id":719,"index":2,"step":"2 - Seleccionar una zona que tenga contratos pendientes de revisar (esta información se muestra en el maestro en la columna A revisar') Seleccionar un registro de la parte inferior (panel Detalle por motivo) y pulsar el botón Revisar.'","data":"","result":"Se abre la pantalla Verificación de lecturas: Detalle de zona","attachments":[]},{"id":720,"index":3,"step":"3 - Seleccionar un motivo de verificación, marcar la opción sin revisar y pulsar sobre el botón Buscar.","data":"","result":"Se muestran los contratos que están pendientes de revisar. Tomamos nota de varios contratos para crear el lote de inspección.","attachments":[]},{"id":721,"index":4,"step":"4 - Ir a OC -> Gestión de lecturas -> Proceso de lecturas -> Toma y gestión de lecturas -> Lotes de lectura -> Pestaña Crear lotes de inspección. 1) Pulsamos el botón Añadir y buscar los contratos que hemos apuntado anteriormente. Se debe crear una inspección por cada contrato. 2) Pulsamos sobre el botón Aceptar.","data":"","result":"1) Se abre la ventana de detalle de petición de inspección. 2) El sistema indicará que los lotes se completarán y serán creados definitivamente. Aceptar para continuar. Se generarán informes en formato PDF con los lotes creados. Finalmente, se muestra un mensaje indicando que se han creado. Se creala inspección en estado PENDIENTE.","attachments":[]},{"id":722,"index":5,"step":"5 - 1) Seleccionar las inspecciones generadas en el paso anterior y pulsar sobre el botón Crear lotes de inspección 2) Pulsar Aceptar.","data":"","result":"1) El sistema muestra los registros seleccionados anteriormente y que se incluirán en el lote de inspección que vamos a crear 2) Se crea un lote de inspección para todas las inspecciones seleccionadas. Pudiendo crear un lote de inspección para cada inspección o un lote de inspección para varias inspecciones.","attachments":[]},{"id":723,"index":6,"step":"6 - Ir a OC -> Gestión de lecturas -> Proceso de lecturas -> Toma y gestión de lecturas -> Gestión de lotes de lectura. 1) En el apartado LOTES PENDIENTES, seleccionar el lote de inspección anteriormente creado y pulsar sobre el botón Emitir. En el mensaje de confirmación indicar que se desean simular los lotes de inspección. 2) Añadir fecha de lectura, hora y diferencia entre lecturas (cualquier valor), operario.","data":"","result":"1) El lote pasa al panel LOTES EMITIDOS. 2) El lote cambia a estado Emitido.","attachments":[]},{"id":724,"index":7,"step":"7 - 1) Seleccionar el lote emitido desde el Panel de lotes EMITIDOS y pulsar sobre el botón Grabar Inspecciones. 2) Completamos los siguientes campos: Número de contrato Lectura. Tipo de lectura. Lector. Observación. Pulsamos sobre el botón Añadir.","data":"","result":"1) Se abre la ventana de Introducción de inspecciones. 2) Se añade correctamente la lectura para el lote de inspección","attachments":[]},{"id":725,"index":8,"step":"8 - 1) Seleccionar el lote emitido desde el panel de lotes EMITIDOS y pulsar sobre el botón Lote. 2) Pulsar sobre el botón Finalizar grabación 3) Seleccionar el lote desde el panel lotes grabados y seleccionar el botón lote > pestaña lecturas Cerrar 3) Seleccionar el lote desde el panel Lotes GRABADOS y pulsar sobre el botón Actualizar","data":"","result":"1) Se abre la ventana de delalle de lote 2) El lote pasa al panel Lotes Grabados. 3) Verificar que la lectura y la observación son las que hemos introducido 4) El lote se actualiza correctamente.","attachments":[]}]}}},{"id":242,"testExecKey":"TEST-457","testKey":"TEST-408","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1800 - Realizar cambio de contador a partir petición de cambio","customfield_12404":{"steps":[{"id":726,"index":1,"step":"1 - OC > gestión de lecturas > contadores > cambios de contador > peticiones de cambio de contador Botón Añadir Informar el campo contrato en Alta Informar un motivo Botón aceptar","data":"","result":"","attachments":[]},{"id":727,"index":2,"step":"2 - Buscar el contador al que hemos hecho el cambio","data":"","result":"nos muestra el registro que acabamos de dar de alta con el estado en Pendiente","attachments":[]},{"id":728,"index":3,"step":"3 - Teniendo seleccionada la línea del contrato informar un contratista y botón enviar a gestor de órdenes Marcar si en la confirmación","data":"","result":"Debe informarnos del proceso de creación de lotes, con el número de lote y el contratista El estado debe ser en curso","attachments":[]},{"id":729,"index":4,"step":"4 - Entrar dentro del registro y desde el botón lote asignado > pestaña cambios > botón reimprimir partes","data":"","result":"Debe visualizarse el impreso de parte cambio contador","attachments":[]},{"id":730,"index":5,"step":"5 - Grabar el parte (OC > gestión de lecturas > contadores > cambios de contador > lotes de cambio de contador > botón grabación de partes) teniendo marcado el lote donde se encuentra el contador al que queremos hacer el cambio Informar el campo contrato y dar return Informar la fecha de la visita y el operario Informar la lectura del CONTADOR RETIRADO informar el número de serie, la marca, modelo, calibre, año de fabricación y la lectura inicial del CONTADOR INSTALADO Botón aceptar","data":"","result":"Grabación del cambio de contador como realizado El estado del lote debe ser emitido","attachments":[]},{"id":731,"index":6,"step":"6 - Ahora verificaremos el cambio OC > gestión de lecturas > contadores > cambios de contador > lotes de cambio de contador > Verificar y actualizar cambios > botón verificar seleccionados","data":"","result":"Debe desaparecer de la pantalla en donde estamos con los cambios grabados seleccionados Debe aparecer en la pantalla donde estamos con los cambios verificados seleccionados","attachments":[]},{"id":732,"index":7,"step":"7 - Ahoraactualizaremos el cambio OC > gestión de lecturas > contadores > cambios de contador > lotes de cambio de contador > Verificar y actualizar cambios > botón actualizar verificados","data":"","result":"Debe desaparecer de la pantalla en donde estamos con los cambiosverificados seleccionados","attachments":[]},{"id":733,"index":8,"step":"8 - Comprobar si ha realizado el cambio de contador correctamente OC > gestión de lecturas > contadores > cambios de contador > cambios de contador registrados Buscar el contador cambiado desde el botón punto de servicio > pestaña contadores","data":"","result":"Debe existir una línea con el antiguo contador en estado baja y la fecha de baja informada con el día que se ha hecho el cambio de contador debe existir una línea con el nuevocontador con estado instalado y con la fecha de alta con el día que se ha hecho el cambio de contador","attachments":[]},{"id":734,"index":9,"step":"9 - Realizar un cambio de contador de una explotación con GOT","data":"","result":"Relizar todo el procedimiento en GOT, hasta que la OT llegue a CF y certificarla","attachments":[]}]}}},{"id":243,"testExecKey":"TEST-457","testKey":"TEST-409","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1900 - Facturador periódico","customfield_12404":{"steps":[{"id":735,"index":1,"step":"1 - Ir a OC > Gestión de facturación > Proceso de facturación > Facturador Periódico. Pulsar el botón Añadir: Iniciar 2 nuevas facturaciones: Local: Seleccionar la opción Contrato, buscar un número de contrato y marcar el flag Impresión local. Envío al impresor: Seleccionar la opción Zona y un registro del panel para añadir la facturación periódica. Entrar en una de estas facturaciones","data":"","result":"Seleccionar la pestaña Contratos y comprobar que se han añadido los contratos.","attachments":[]},{"id":736,"index":2,"step":"2 - Seleccionar el registro creado enel paso anterior con estado SELECCIONADOS CONTRATOS y pulsar el botón Facturar","data":"","result":"La facturación pasa de estado SELECCIONADOS CONTRATOS a estado PREFACTURADO. Seleccionar la pestaña Facturas y comprobar que se han generado las facturas con estado PROVISIONAL sin número de factura.","attachments":[]},{"id":737,"index":3,"step":"3 - Seleccionar el registro creado en el paso anterior y pulsar el botón Generar Mensajes.","data":"","result":"La facturación pasa de estado PREFACTURADOa estado GENERADOS MENSAJES. Comprobar que los mensajes se han creado para las facturas siguiendo los criterios de parametrización de mensajes.","attachments":[]},{"id":738,"index":4,"step":"4 - Seleccionar el registro creado en el paso anterior y pulsar el botón Aceptar. En el caso que tenga repasos pendientes, abrir el registro del facturador periódico para ver el detalle y seleccionar la pestaña Facturas a repasar. Ir revisando las diferentes subpestañas e ir validando las diferentes facturas.","data":"","result":"La facturación pasa de estado GENERADOS MENSAJES a estado ACEPTADA. Comprobar que en la pestaña Facturas las facturas han pasado de estado PROVISIONAL a PENDIENTE, y se ha generado el número de factura.","attachments":[]},{"id":739,"index":5,"step":"5 - Seleccionar el registro creado en el paso anterior y pulsar el botón Documentos.","data":"","result":"La facturación pasa de estado ACEPTADA a GENERADOS DOCUMENTOS. Comprobar que en la pestaña Documentos se han generado los registros con los datos de los documentos generados. Comprobar que los documentos se pueden consultar desde el botón ciclo, y se imprimen los duplicados.","attachments":[]}]}}},{"id":244,"testExecKey":"TEST-457","testKey":"TEST-410","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1910 - Impresión duplicado factura","customfield_12404":{"steps":[{"id":740,"index":1,"step":"1 - 1) Ir a OC > Gestión de facturación > Proceso de facturación > Facturador periódico. Abrir el registro de facturación realizado en el proceso anterior y que se encuentre en el estado GENERADOS DOCUMENTOS. 2) Ir a la pestaña Contratos a facturar del detalle de facturación,seleccionar la subpestaña General y seleccionar un contrato. Pulsar el botón Ciclo. 3) Ir a la pestaña Documento del detalle del ciclo de contrato, seleccionar el registro y pulsar el botón Duplicado de factura.","data":"","result":"1) Se abre el detalle de facturación. 2) Se abre el detalle de ciclo de contrato. 3) Se imprime el duplicado de factura.","attachments":[]},{"id":741,"index":2,"step":"2 - 1) Ir a OC >Contratación > Proceso de contratación > Contratos. Buscar un contrato y pulsar el botón Modicar para abrir el detalle. 2) Ir a la pestaña Ciclo del detalle del contrato,posicionarse en una línea, pulsar el botón modificar 3) Ir a la pestaña Documento del detalle del ciclo de contrato, seleccionar el registro y pulsar el botón Duplicado de factura.","data":"","result":"2) Se abre el detalle del ciclo de contrato. 3) Se imprime el duplicado de factura.","attachments":[]}]}}},{"id":245,"testExecKey":"TEST-457","testKey":"TEST-411","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1920 - Abono y refacturación masivas","customfield_12404":{"steps":[{"id":742,"index":1,"step":"1 - Operación comercial > gestión de facturación > proceso de facturación > facturador periódico Seleccionar una facturación que su estado sea documentos creados Botón abonar Informar el motivo de abono y el de devolución del cobro Aceptar","data":"","result":"Saldrá un mensaje de que se ha planificado la tarea de abonar facturación para un dia y hora determinado","attachments":[]},{"id":743,"index":2,"step":"2 - Operativa de sistema > gestión de tareas > gestión de tareas > pestaña árbol en ejecución Desplegar el árbol Buscar la carpeta abonar facturación, desplegarla Situarse en lacarpeta abonar facturación Botón Replanificar Informar el Servidor, la fecha y hora de planificación en la que queramos que se ejecute esta tarea y aceptar","data":"","result":"Generalmente la tarea de abonar facturación se planifica para ejecutarse a una hora en que haya poca actividad Mediante la pestaña gestión de tareas planificadas podemos controlar el estado de la misma Se da por acabada la taarea cuando su estado es finalizada Con este paso conseguimos que se ejecute la tarea en la fecha y hora que nos interesa","attachments":[]},{"id":744,"index":3,"step":"3 - Volver al menú de facturador periódico Buscar la facturación que acabamos de abonar","data":"","result":"Después de abonarla debe tener informada la columna Abonada a SI, la fecha de abono y el usuario que lo ha realizado también deben estar informados","attachments":[]},{"id":745,"index":4,"step":"4 - Entrar en algunos de los contratos que se acaban de abonar en la pestaña facturación","data":"","result":"La línea del periodo que se ha abonado queda en gris y ha cambiado el estado a abonada Ha creado una nueva línea con el mismo periodo con importe negativo y en color gris En esa línea debe estar informada la causa del abono y la columna de operación debe ser abonar","attachments":[]},{"id":746,"index":5,"step":"5 - Importante: Cuando se abona una facturación y posteriormente se refactura, es que la factura no estaba correcta En estos casos deben modificarse los datos que han inducido al error para que cuando se refacture las facturas sean correctas","data":"","result":"","attachments":[]},{"id":747,"index":6,"step":"6 - Volver al menú facturador periódico Seleccionar la facturación que hemos abonado Aceptar con los datos por defecto que se nos muestran Botón refacturación","data":"","result":"Se nos informa con un mensaje de que la tarea de refacturar facturaciones abonadas ha finalizado con éxito En la línea de la facturación se han informado los campo fecha y usuario de refacturación y la columna refacturada está informada con SI","attachments":[]},{"id":748,"index":7,"step":"7 - Ir a los contratos que forman parte de esta refacturación, pestaña facturación","data":"","result":"Ha creado una línea en gris con el importe en positivo y el estado provisional También tiene informada la causa de abono y en el campo operación tiene informado refacturar","attachments":[]},{"id":749,"index":8,"step":"8 - Operativa comercial > gestión de facturación > procesos de facturación > refacturaciones masivas Seleccionar la facturación que acabamos de refacturar, su estado debe ser prefacturado Botón aceptar En el caso de dar el mensaje de que hay facturas a repasar, entrar y repasarlas o validarlas","data":"","result":"Informa de que la tarea aceptar facturación ha finalizado correctamente","attachments":[]},{"id":750,"index":9,"step":"9 - Botón generar documentos","data":"","result":"informa de que la tarea generar documentos ha finalizado con éxito En la línea que acabamos de generar los documentos su estado debe estar informado como documentos creados","attachments":[]},{"id":751,"index":10,"step":"10 - Entrar en algunos de los contratos que se acaban derefacturar en la pestaña facturación","data":"","result":"Siguen existiendo las dos líneas anteriores de abono y abonada en gris Ha creado una nueva línea con el mismo periodo con importe positivo y con el estado y el color igual que tenía antes de abonarla En esa línea debe estar informada la causa del abono y la columna de operación debe ser refacturar","attachments":[]}]}}},{"id":246,"testExecKey":"TEST-457","testKey":"TEST-412","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1930 - Refacturación individual","customfield_12404":{"steps":[{"id":752,"index":1,"step":"1 - Operativa comercial > Contratación > Proceso de contratación > contratos Buscar un contrato que tenga facturas en estado pendiente Pestaña facturación Botón abonar","data":"","result":"Se abre la pantalla de selección de ciclos a abonar, mostrando todos los ciclos pendiente de cobrar","attachments":[]},{"id":753,"index":2,"step":"2 - Seleccionar una línea o más (a tener en cuenta para luego el sumatorio de los importes abonados) Indicar un motivo de abono Botón aceptar","data":"","result":"Por pantalla muestra la factura de abono con los importes en negativo En la pantalla de facturación, la factura que estaba pendiente queda como estado abonada y en gris Además se ha creado otra línea con el estado abono, el importe en negativo, la causa de abono informada y en gris","attachments":[]},{"id":754,"index":3,"step":"3 - 1- Desde la pestaña facturación, seleccionar la factura en estado abonada y el botón ciclo 2- Botón refacturar Cuando muestre la pantalla selección de tipo de refacturación, marcar el botón manual y aceptar 3- Se abre la pantalla del detalle de la nueva factura, dar aceptar","data":"","result":"1- Se abre la pantalla del detalle del ciclo del contrato al que pertenece la factura abonada 2- Se abre la pantalla de insercción de lecturas manuales para permitirnos corregir el error que ha dado pie a el abono de la factura, también abrirá el detalle de los datos de la facturación con el mismo propósito 3- En la pestaña facturación debe crear una factura en estado pendiente y en azul con el importe que se ha refacturado No deben eliminarse las líneas con estado abono y abonada creadas en le momento del abono La fecha de factura de la factura con estado abono y pendiente deben ser del dia en el que se ejecuta el proceso","attachments":[]}]}}},{"id":247,"testExecKey":"TEST-457","testKey":"TEST-413","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1940 - Simulación periódica","customfield_12404":{"steps":[{"id":755,"index":1,"step":"1 - Ir a OC > Gestión de facturación >proceso de facturación > Simulador-Facturador manual. 1- Buscar un contrato, indicar en el proceso a realizar que es una simulación, seleccionar un motivo del desplegable y pulsar el botón Realizar proceso seleccionado. 2- Dentro de la pantalla de simulación de facturación, añadir la fecha de la lectura actual, añadir la lectura de la esfera 1, pulsar Simular 3- Una vez dentro del detalle de factura dar al botón aceptar, confirmará el importe de la simulación y editará la factura, volverá a la pantalla de simulación de facturación, y en la parrilla inferior izquierda aparecerá el periodo y el documento que se acaba de simular la facturación 4- Ir al botón facturación, se abrirá la pantalla del detalle de facturación, en la pestaña de facturas, se pueden contemplar las facturas simuladas","data":"","result":"Se realiza correctamente la simulación de la factura. Se imprime el pdf con la factura realizada con la simulación.","attachments":[]}]}}},{"id":248,"testExecKey":"TEST-457","testKey":"TEST-414","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1950 - Facturación Manual","customfield_12404":{"steps":[{"id":756,"index":1,"step":"1 - Ir a OC > Gestión de facturación > Proceso de facturación > Simulador - Facturador manual'","data":"","result":"Se muestra la ventana principal del simulador, facturador manual. Desde la que se puede iniciar el proceso de simulación de facturas, o facturación manual de origen varios.","attachments":[]},{"id":757,"index":2,"step":"2 - Seleccionar el contrato que tiene asociado el idioma Español, mediante el selector Contrato.","data":"","result":"Se selecciona el contrato.","attachments":[]},{"id":758,"index":3,"step":"3 - Como proceso a realizar: Nueva facturación manual Motivo: Seleccionar un motivo que corresponda a origen varios Hacer Realizar proceso seleccionado'.'","data":"","result":"Se seleccionan los datos,y se inicia el proceso de facturación manual. Abriéndose, la ventana de seleccion de tarifas.","attachments":[]},{"id":759,"index":4,"step":"4 - Seleccionar uno de los elementos de la lista (que corresponden a un rango de aplicación de tarifas para la tarifa indicada). Aceptar para continuar.","data":"","result":"Se selecciona una aplicación tarifa (precios) y al aceptar se avanza a la pantalla de edición de facturas. Donde aparece el detalle de la factura de origen varios generada. Los conceptos y precios (visibles en las líneas), dependeránde la tarifa seleccionada en los pasos anteriores (a través del motivo) y de los rangos de precios seleccionados en la pantalla anterior.","attachments":[]},{"id":760,"index":5,"step":"5 - en la pantalla de edición de factura, Aceptar, para hacer definitiva la factura. Hacer Aceptar también, en la ventana intermedia que confirma el importe.","data":"","result":"Se hace definitiva la factura, y se genera su documento factura asociado. Después de finalizar la transacción. el PDF generado, debe ser coherente con la facturación manual, y emitirse en idioma español.","attachments":[]},{"id":761,"index":6,"step":"6 - Repetir los pasos anteriores, sobre un contrato cuyo idioma seleccionado no sea el Español.","data":"","result":"Siguiendo los pasos, se generará una factura, el documento de la cual estará en el idioma indicado con el contrato. Mostrándose correctamente y con datos coherentes a los de la factura.","attachments":[]}]}}},{"id":249,"testExecKey":"TEST-457","testKey":"TEST-415","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1960 - Factura Recapitulativa - Generación","customfield_12404":{"steps":[{"id":762,"index":1,"step":"1 - Seleccionar o preparar (si no se encuentran) dos contratos de la misma zona de un mismo cliente para una misma explotación pendientes de facturar. Nota: una manera de localizarlo, es ir a la pantalla [OC > Gestión de facturación > Proceso de facturación > Acceder a la facturación de una zona completa > Ir a la pestaña contratos a facturar'], orenar por cliente y buscar clientes con varios contratos.'","data":"","result":"Paso previo.","attachments":[]},{"id":763,"index":2,"step":"2 - Ir al detalle del cliente [OC > proceso de contratación > Contrato > Introducir el contrato de unos de los clientes localizados > Modificar contrato > Hacer clic en botón cliente ]de los contratos anteriores y crearle una agrupación. Pestaña cliente --> subpestaña agrupaciones > Hacer clic en añadir > en el detalle de agrupacion de contratos, hacer clic en 'crear contrato principal'. Rellenar los datos teniendo en cuenta: Dato 'zona'= zona que vamos a facturar. Dato 'Dirección Pto. Servicio'= uno de los ptos de servicio del cliente. Dato 'Señas de cobro'= Una se las señas de cobro del cliente. Dato 'Tipo factura'= un tipo de factura que se desee. Ejemplo = Papel Dato 'Tipo envio '= Un tipo de envío que se desee. Ejemplo: Correo ordinario. hacer clic en 'aceptar'","data":"","result":"Se crea el contrato principal y se vuelve al detalle agrupación contrato'","attachments":[]},{"id":764,"index":3,"step":"3 - En el detalle agrupación de contratos'rellenar: Contrato Principal = con el contrato que se ha creado en el paso anterior. Descripción: Texto que se desee. Hacer clic a 'aceptar'.'","data":"","result":"Se crea la agrupación.","attachments":[]},{"id":765,"index":4,"step":"4 - En los detalles de los contratos del cliente > Pestaña contrato en el desplegable Agrupación seleccionar la agrupación creada en el paso anterior. Guardar el cambio Esto se debe realizar en los contratos que se quieran incluir en la agrupación del mismo cliente.","data":"","result":"","attachments":[]},{"id":766,"index":5,"step":"5 - Ir al facturador periódico [Gestión de Facturación > Proceso de Facturación] Hacer clic en Añadir' Seleccionar 'Cliente'. Buscar haciendo clic en 'persona'. En el Maestro de Persona, introducir uno de los contratos donde previamnete hemos asignado una agrupación y buscar. Seleccionar el registro devuelto. En la pantalla 'selección de zonas a facturar'hacer clic a 'aceptar' Se inicia el proceso de selección de contratos a facturar. '","data":"","result":"Los contratos quedan en estado Seleccionar contrato'","attachments":[]},{"id":767,"index":6,"step":"6 - Hacer clic en Facturar'","data":"","result":"La facturación queda en estado prefacturado'y Modalidad = 'Proforma'.'","attachments":[]},{"id":768,"index":7,"step":"7 - Ir al Facturador Recapitulativas actualmente en 'Nuevas Funciones'o bien dentro del proceso de facturación. Seleccionar el cliente, contrato principal y mes año en el que se efectua la facturación.. Clicar en realizar la factura recapitulativa.'","data":"","result":"Se abre la ventana de factura recapitulativa con la relación de los contratos secundarios, donde aparece el botón Visualizar doc.'deshabilitado.'","attachments":[]},{"id":769,"index":8,"step":"8 - Clicar en facturar y finalizar el proceso de edición de la nueva factura recapitulativa.","data":"","result":"Se genera la factura recapitulativa.","attachments":[]},{"id":770,"index":9,"step":"9 - Ir al punto de menu [Operativa Comercial > Gestión de Facturación > Proceso de Facturación > Facturador Periódico]","data":"","result":"Verficamos que la facturación proforma ha quedado en estado Generados Documentos'. Se ha creado una linea con factura 'Modalidad'=recapitulativa y 'estado'generado documentos.'","attachments":[]}]}}},{"id":250,"testExecKey":"TEST-457","testKey":"TEST-416","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1970 - Factura Recapitulativa: Abonar","customfield_12404":{"steps":[{"id":771,"index":1,"step":"1 - Ir al Facturador Recapitulativas actualmente en 'Nuevas Funciones'o bien dentro del proceso de facturación. Ir a la pestaña 'Abonar/Refacturar recapitultiva'Seleccionar el cliente de la factura recapitulativa generada en el caso anterior y hacer clic en 'buscar'","data":"","result":"Aparece la factura generada en el paso anterior.","attachments":[]},{"id":772,"index":2,"step":"2 - Seleccionar la factura y hacer clic en abonar","data":"","result":"Al realizar el prcoeso se genera la factura de abono y la factura anterior queda en estado abonada'.'","attachments":[]}]}}},{"id":251,"testExecKey":"TEST-457","testKey":"TEST-417","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-1980 - Factura Recapitulativa: Refacturar","customfield_12404":{"steps":[{"id":773,"index":1,"step":"1 - Ir al Facturador Recapitulativas actualmente en 'Nuevas Funciones'o bien dentro del proceso de facturación. Ir a la pestaña 'Abonar/Refacturar recapitulaltiva'Seleccionar el cliente de la factura recapitulativa generada en el caso anterior y hacer clic en 'buscar'","data":"","result":"Aparece la factura de abono y abonada generada en el paso anterior.","attachments":[]},{"id":774,"index":2,"step":"2 - Seleccionar la factura y hacer clic refacturar.","data":"","result":"","attachments":[]},{"id":775,"index":3,"step":"3 - En la ventana emergente selección refacturación facturas proforma'seleccionar la factura en el apartado 'factura proforma originales'y hacer clic en 'aceptar'","data":"","result":"Aparece ventana de refactura recapitulativa.","attachments":[]},{"id":776,"index":4,"step":"4 - Hacer clic en Facturar' Seguir todos los pasos hasta acabar la edición de facturas.'","data":"","result":"Se genera la nueva factura recapitulativa.","attachments":[]}]}}},{"id":252,"testExecKey":"TEST-457","testKey":"TEST-418","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2000 - Operaciones de Caja","customfield_12404":{"steps":[{"id":777,"index":1,"step":"1 - Puntos a tener en cuenta: Si el proceso que se realiza es el cobro por TARJETA, tener en cuenta que el cliente debe tener señas de cobro por domiciliación bancaria y a nivel de banco gestor de las sociedades de la explotación tiene que permitirse el pago por tarjeta Si el proceso es deENTREGA A CUENTAse realiza desde la pestaña Movimientos cuenta > botón entrega a cuenta Si el proceso es deDEVOLUCIÓNDE DISPONIBLEse realiza desde la pestaña Movimientos cuenta > botón devolución de disponible","data":"","result":"","attachments":[]},{"id":778,"index":2,"step":"2 - 1) Ir a OC > Gestión de facturación > Proceso de facturación > Facturas > Pestaña Criterio combinado. Realizamos una búsqueda de facturas impagadas y tomamos nota del número de contrato. Seleccionamos una fecha de inicio y fin. En el campo estado seleccionamos IMPAGADA 2) Ir a OC > Conttratación > Proceso de contratación > Contratos. Buscamos el contrato seleccionado del paso anterior. 3) Abrimos el detalle del contrato y seleccionamos la pestaña Facturación. Pulsamos sobre el botón Cobro facturas. 4) Seleccionamos la factura a cobrar, forma de pago y pulsamos sobre el botón Añadir Cobro","data":"","result":"1) Paso previo. 2) Paso previo. 3) Se abre la ventana de Cobro de facturas. 4) Se realiza el cobro correctamente. La factura cambia de estado IMPAGADA a estado COBRADA.","attachments":[]}]}}},{"id":253,"testExecKey":"TEST-457","testKey":"TEST-419","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2010 - Cobro por TPV","customfield_12404":{"steps":[{"id":779,"index":1,"step":"1 - A tener en cuenta para esta prueba: 1- que las oficinas de la explotación del contrato que se seleccione, tienen como vía de comunicación Teléfono, verificarlo en Datos maestros > oficinas 2- que las oficinas de la explotación del contrato que se seleccione, tienen informado en la forma de pago TPV VIRTUAL, verificarlo en Datos maestros > oficinas > pestaña forma de pago Ir a OC > Contratación > Proceso de contratación > Contratos'y acceder al detalle de un contrato. (A tener en cuenta que las oficinas de la explotación de ese contrato tienen como vía de comunicación Teléfono, verificarlo en Datos maestros > oficinas) Ir a la pestaña de facturación, hacer 'Cobro facturas'para iniciar el proceso de cobro.'","data":"","result":"Se accede al contrato y a la pestaña de facturación del mismo.","attachments":[]},{"id":780,"index":2,"step":"2 - Se muestra la ventana de cobro de facturas. Seleccionar alguna de las facturas en estado Pendiente / Impagado. En el bloque nuevo cobro'marcar la opción 'TPV'y rellenar los campos asociados al TPV: Número targeta Mes y año de caducidad Añadir cobro'","data":"","result":"El sistema indica que se ha registrado el pago por TPV y que este quedará pendiente hasta que se cierre la ventana de cobro con la opción Aceptar'. A su vez, en la pestaña 'Pagos realizados', se ha incorporado el pago realizado por targeta bancaria.'","attachments":[]},{"id":781,"index":3,"step":"3 - Aceptar para confirmar el pago de la factura.","data":"","result":"El sistema indica que en este momento se relizará el pago por TPV. De modo que en este momento se hace la connexión con el proveedor de TPV. Cuando finalice, nos mostrará un mensaje con el resultado del mismo","attachments":[]}]}}},{"id":254,"testExecKey":"TEST-457","testKey":"TEST-420","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2020 - Emitir documento de pago","customfield_12404":{"steps":[{"id":782,"index":1,"step":"1 - Ir a OC > Contratación > Proceso contratación > contratos', realizar una búsqueda y acceder al detalle de un contrato que tenga facturas sin pagar (pestaña facturación: estado Pendiente, Impagado) En caso de no encontrar facturas pendientes de cobro o impagadas, hacer el proceso de devolución, mediante el botón 'Devolución'de la pestaña Facturación del contrato.'","data":"","result":"En la pestaña Facturación del detalle del contrato, aparece la lista de Facturas internas emitidas para ese contrato y su estado.","attachments":[]},{"id":783,"index":2,"step":"2 - Hacer Emitir documento pago'para iniciar el proceso de emisión.'","data":"","result":"Aparecerá una ventana indicando que existen documentos pendientes, y al confirmar, una segunda ventana donde se indican los Ciclos / Plazos pendientes de pago del contrato.","attachments":[]},{"id":784,"index":3,"step":"3 - Hacer Doc pago Facturas'para proceder a emitir un documento de pago sobre las facturas del contrato'","data":"","result":"Aparecerá una ventana con la lista de facturas pendientes de pago del contrato. Y se podrá consultar el detalle de cada una de ellas a medida que se seleccionen.","attachments":[]},{"id":785,"index":4,"step":"4 - Seleccionar un grupo de facturas y hacer Emitir documento de pago'","data":"","result":"Aparecerá una ventana de confirmación previa, con el importe de las facturas selecionadas y la fecha de vencimiento del documento.","attachments":[]},{"id":786,"index":5,"step":"5 - Hacer Sí para continuar.","data":"","result":"Se creará el documento de pago. El documento generado mostrará el importe total de las facturas.","attachments":[]}]}}},{"id":255,"testExecKey":"TEST-457","testKey":"TEST-421","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2100 - Generación de Remesa","customfield_12404":{"steps":[{"id":787,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Nueva gestión de cartera > Pestaña Remesa. 2) Seleccionamos una fecha límite de factura o una Zona/Año/Período. 3) Pulsamos el botón Generar Remesas. Generamos la remesa provisional.","data":"","result":"3)Comprobamos que se han generado tantos ficheros de remesa como Bancos Propios existentes en la Sociedad.","attachments":[]},{"id":788,"index":2,"step":"2 - 1)Ir a OC > Gestión de cartera > Operaciones sobre la cartera, buscar la remesa bancaria creada en el punto anterior mediante selección de fecha de creación. seleccionar el registro obtenido que debe estar informado en la columna Operación cobro', en la columna Tipo Gestión 'remesa bancaria', en la columna Terminada 'No'2) Abrir un registro e ir a la pestaña Facturas. 3) Seleccionar el registro de la remesa y pulsar en el botón Hacer definitiva.'","data":"","result":"1) Comprobar que se visualizan los registros correspondientes a la remesa generada en el paso anterior. 2) Comprobar que se han añadido las facturas en el detalle de la operación de cartera. Abrir una factura y comprobar que el estado anterior es PENDIENTEy el nuevo estado es COBRADA. 3) La remesa pasa a estado Terminada, y se genera en el directorio configurado en Operativa del sistema > gestión de servidor > propiedades del servidor, columna Propiedad tenga informado dir.EDITRAN/Codigo Sociedad/CSB19REM/export el fichero de remesa.","attachments":[]}]}}},{"id":256,"testExecKey":"TEST-457","testKey":"TEST-422","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2110 - Generacion de Cobro por ventanilla","customfield_12404":{"steps":[{"id":789,"index":1,"step":"1 - En la pantalla Datos Maestros > Explotación > Pestaña Operación de Cartera tiene que estar marcado el check Emisor de recibos por Explotación'y definido un emisor de recibos en la pestaña Tratamiento Ventanilla. Por defecto ya están configurados en las explotaciones de los entornos de Calidad. El formato del fichero es el 57.'","data":"","result":"Datos previos","attachments":[]},{"id":790,"index":2,"step":"2 - Previamente se emite un documento de pago. Acceder a la pantalla [Operativa Comercial > Contratación > Proceso de Contratación > Contratos > Pestaña Facturas] de un contrato que tenga facturas pendientes. Hacer clic en el Botón Emitir Doc. Pago Facturas]. En el documento de pago utilizaremos diferentes elementos para el cobro por ventanilla: - Referecia - Importe - Emisor/Sufijo","data":"","result":"Se emite documento de pago con referencia según formato parametrizado en la explotación. Referencia: Se debe coger la númración eliminado el guión. Importe Emisor/Sufijo","attachments":[]},{"id":791,"index":3,"step":"3 - Realizar un fichero según normativa. Ejemplo CSB57. Ir al caso de uso CU_GCAR_GCAR_Crear Operación Remesa Bancaria copia'. Se utilizará los datos del documento de pago creado en el paso previo. Nota: Se deja ejemplo de fichero en la ruta de recursos QA. Cosas a tener en cuenta en la maniplación de fichero: . Cuando se utilize el fichero de ejemlo, importante guardarlo con nombre nuevo, ya que cuando se ejecute la recepción de fichero Edi, el sistema elimina el fichero de la carpeta. . En las lineas que empieza por 0270, 6070 y 8070 de la columna 11 a la 21, se informa el emisor/sufijo completo sin el guion. . En las lineas 0170 y 9070 se la columna 11 a la 18 se informa el emisor y no se informa ni el guion ni los números posteriores a este. . En la linea 6070, de la columna 77 a la 89 se informa la referencia sin el guón. . En la linea 6070, 8070 y 9070, de las coliumnas 37 a la 49, se informa el importe del documento de cobro alineados la derecha siendo los 2 últimos número los correspondientes a los decimales, completando con 0 todas las posiciones de la izquierda restantes.'","data":"","result":"Paso previo","attachments":[]},{"id":792,"index":4,"step":"4 - Ir a la pantalla Operativa Comercial > Gestión de Cartera > Recepción de Fichero Edi. Seleccionar el fichero Edi creado formato CSB57 guardado en el paso anterior.","data":"","result":"El fichero se procesa correctamente. En la pantalla Operaciones sobre la cartera [OC > Gestión de la cartera], hacer búsqueda de la operación acabada de generar. Se ha generado una operación con tipo de gestión de ventanilla Bancaria'. En el caso de errores, enla pantalla de notificación de procesos se añadira registro con el error detectado'","attachments":[]},{"id":793,"index":5,"step":"5 - Clicar a Modifcar'a la operación seleccionada.'","data":"","result":"Se accede al detalle de la operación de cartera donde se informa del importe de la operación de la misma.","attachments":[]}]}}},{"id":257,"testExecKey":"TEST-457","testKey":"TEST-423","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2120 - Diferir cobro","customfield_12404":{"steps":[{"id":794,"index":1,"step":"1 - 1) Ir a OC > Contratación > Proceso de contratación > Contratos. Ir al detalle de uno de los contratos para los que se ha realizdo la facturación manual. 2) Accede a la pestaña Facturación, y procede a pagar la factura de origen Varios, pulsando el botón Cobro Facturas 3) En la ventana de pago, indicar que se quiere diferir el pago de la Factura. Seleccionando la factura y pulsando el botón Diferir cobro. 4) Si la explotación está parametrizada a diferir en Plazos (datos maestros > explotaciones > pestaña facturación > pestaña generación de facturas > grupo sociedad emisoras > pestaña general > campo permitir diferir cobro de facturas verificar que en la pestaña de operación de cartera el campo número de plazos cobro dif. tiene información), indicar el número de plazos a diferir y que se difiera a partir del ciclo siguiente (valor 1).","data":"","result":"3) La factua no aparecera como Cobrada, sinó que se creará una operación cartera de BLOQUEO de tipo COBRO DIFERIDO. 4) Si se ha diferido en plazos, en la pestaña de desgloses se indicarán los plazos y el número de ciclo en que estos aplicarán.","attachments":[]}]}}},{"id":258,"testExecKey":"TEST-457","testKey":"TEST-424","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2130 - Crear compromiso de pago","customfield_12404":{"steps":[{"id":795,"index":1,"step":"1 - 1) Ir a OC > Gestión de facturación > Proceso de facturación > Facturas > Pestaña Criterio combinado. Realizamos una búsqueda de facturas impagadas y tomamos nota del número de contrato. Seleccionamos una fecha de inicio y fin. En el campo estado seleccionamos IMPAGADA 2) Ir a OC > Contratación > Proceso de contratación > Contratos. Buscamos el contrato seleccionado del paso anterior. 3) Abrimos el detalle del contrato y seleccionamos la pestaña Facturación. Pulsamos sobre el botón Cobro facturas. 4) Seleccionamos la/s factura/s a incluir en el compromiso de pago y pulsamos el botón Nuevo compromiso de pago.","data":"","result":"4) Se abre la ventana de creación del nuevo compromiso de pago","attachments":[]},{"id":796,"index":2,"step":"2 - 1) Seleccionamos la forma de pago y el gestor de cobro, repasar si el número de plazos es el deseado. Pulsamos sobre el botón Crear plazos. 2) Pulsar Aceptar.","data":"","result":"1) Se abre la ventana de detalle de la operación de cartera. 2) Comprobar lo siguiente: a) El compromiso debería quedar en estado NO Terminado', verificar desde la pestaña cartera, en la columna terminada debe estar informado NO b) Las facturas deben quedar en estado BLOQUEADAS, verificar desde la pestaña cartera, en la columna operación debe estar informado BLOQUEO'","attachments":[]}]}}},{"id":259,"testExecKey":"TEST-457","testKey":"TEST-425","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2140 - Consultar y cobrar cuotas compromiso de pago pendientes","customfield_12404":{"steps":[{"id":797,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Operaciones sobre la cartera > pestaña compromisos, marcar el botón Todos, marcar en tipo de operación bloqueo,seleccionar fechas dentro del cuadro de tipo de operación Seleccionar una línea de las mostradas que en la columna Estado tenga informado EN CURSO 2) Abrir un compromiso de pago para ver el detalle de la operación y pulsar sobre el botón Liquidar. 3) Seleccionar la/s factura/s a cobrar en la liquidación del compromiso y pulsamos el botón Seleccionar ciclos a cobrar. 4) Seleccionar la forma de pago y pulsar el botón Añadir cobro. 5) Pulsar Aceptar.","data":"","result":"2) Se abre la pantalla de pago de Facturas. 4) Se añade el cobro en el panel Pagos realizados. 5) Se liquida el compromiso correctamente. Se crea una operación de cartera de tipo COMPROMISO DE PAGO y tipo operación COBRO. La factura cambia de estado BLOQUEADA a COBRADA.","attachments":[]}]}}},{"id":260,"testExecKey":"TEST-457","testKey":"TEST-426","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2150 - Generación de Devolución","customfield_12404":{"steps":[{"id":798,"index":1,"step":"1 - Nos dirigimos a la pantalla Operaciones sobre la cartera > Pestaña General'[OC > Gestión de cartera] Efectuamos una búsqueda por 'tipo de gestión'= Remesa Bancaria y que la Operación esté terminada. Entramos dentro de la Operación y hacemos clic en el botón Gestión. En el panel ficheros generados, hacemos en visualizar fichero y lo grabamos en una ruta que controlemos. Nos dirigimos a la ruta donde hemos guardado el fichero y lo abrimos con un procesador de texto (Notepad + +).'","data":"","result":"","attachments":[]},{"id":799,"index":2,"step":"2 - Modificar fichero para que tenga formato de devolución. Mirar caso de uso CU_GCAR_GCAR_Crear Operación Remesa Bancaria'. Ejemplo para el formato CSB19-14 (el formato viene definido a nivel de Banco Gestor [OC > Datos Maestros > Datos Maestros Comercial > DM Finanzas y contablidad > Bancos gestores > Buscar por sociedad gestora > Entrar en el gestor por defecto > Pestaña 'datos generales', apartado remesa de abonos]. Datos a modificar del fichero: Coger el fichero y cambiar por un '2'la posición 1 de cada linea. Todas las lineas menos la de totales (empieza por 99) En los registros tipo 3, en la posición 582 indicar motivo de devolución como por ejemplo 'AM04' Todas las lineas deben tener un máximo de 601 posiciones. '","data":"","result":"","attachments":[]},{"id":800,"index":3,"step":"3 - Dirigirse a la pantalla recepción ficheros EDI'[OC > gestión de cartera] Seleccionamos el fichero que hemos generado previamente y le damos aceptar'","data":"","result":"El fichero se procesa correctamente","attachments":[]},{"id":801,"index":4,"step":"4 - Ir a la pantalla contrato'[OC > Contratación > proceso de contratación] Acceder a uno de los contratos que tenía un documento de pago dentro del fichero Dirigirse a la pestaña facturación'","data":"","result":"Comprobar que las facturas constan como impagadas","attachments":[]}]}}},{"id":261,"testExecKey":"TEST-457","testKey":"TEST-427","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2200 - Crear operaciones de CARGO VARIOS, CARGO AYUNTAMIENTO y CARGO ESPECIAL","customfield_12404":{"steps":[{"id":802,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Nueva gestión de cartera. Seleccionamos la pestaña Cargo. 2) Seleccionamos como tipo de cargo Varios y seleccionar explotación 3) Seleccionamos la opción Tipo Cliente y añadimos la opción Particular. 4) Seleccionamos en el combo Gestor del cargo un gestor de cobro a asociar al cargo. 5) Pulsamos el botón Crear cargo nuevo con las condiciones indicadas. 6) Seleccionamos varias facturas y pulsamos el botón Aceptar desde la pestaña gestiones de la sesión, se puede ver la nueva operación con tipo de gestión = cargo varios, operación = bloqueo y definitiva = no Entrar en la línea creada, en la pestaña general la operación = bloqueo Entrar en la pestaña facturas, el estado anterior = impagada Entrar en la factura y verificar que el estado = bloqueada","data":"","result":"5) Paso previo. Se abre la ventana de selección de facturas. 6) Se crea la nueva operación de cartera de tipo CARGO VARIOS, con estado No definitiva y No terminada. Las facturas pasan de estado IMPAGADA a BLOQUEADA.","attachments":[]},{"id":803,"index":2,"step":"2 - 1) Ir a OC > Gestión de cartera > Operaciones sobre la cartera > Buscar la gestión de cartera CARGO VARIOS del paso anterior (operación BLOQUEOcon estado No defintivo y No terminado). 2) Seleccionar el registro y pulsar el botón Hacer definitiva 3) Abrir el cargo variospara ver el detalle de la operación y pulsar sobre el botón Liquidar. 4) Seleccionar el tipo de liquidación total Seleccionar la/s factura/s a cobrar en la liquidación del cargo y pulsamos el botón Seleccionar ciclos a cobrar. 5) Seleccionar la forma de pago y pulsar el botón Añadir cobro. 6) Pulsar Aceptar.","data":"","result":"2) Se imprime un pdf con el detalle de la operación. 3) Se abre la pantalla de pago de Facturas. 5) Se añade el cobro en el panel Pagos realizados. 6) Se liquida el compromiso correctamente. Se crea una operación de cartera de tipo CARGO VARIOS y tipo operación COBRO. La factura cambia de estado BLOQUEADA a COBRADA.","attachments":[]},{"id":804,"index":3,"step":"3 - Repetir los dos pasos anteriores para los tipos de cargo siguientes: CARGO AYUNTAMIENTO. CARGO ESPECIAL.","data":"","result":"","attachments":[]}]}}},{"id":262,"testExecKey":"TEST-457","testKey":"TEST-428","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2210 - Liquidación de cargo varios","customfield_12404":{"steps":[{"id":805,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Operaciones sobre la cartera > Buscar Tipo de Gestión CARGO VARIOS,operación BLOQUEOcon estado No terminado. 2) Abrir uncargo variospara ver el detalle de la operación y pulsar sobre el botón Liquidar. 3) Seleccionar el tipo de liquidación total, seleccionar la/s factura/s a cobrar en la liquidación del cargo y pulsamos el botón Seleccionar ciclos a cobrar. 4) Seleccionar la forma de pago y pulsar el botón Añadir cobro. 5) Pulsar Aceptar.","data":"","result":"2) Se abre la pantalla de pago de Facturas. 4) Se añade el cobro en el panel Pagos realizados. 5) Se liquida el compromiso correctamente. Se crea una operación de cartera de tipoCARGO VARIOSy tipo operación COBRO. La factura cambia de estado BLOQUEADA a COBRADA.","attachments":[]}]}}},{"id":263,"testExecKey":"TEST-457","testKey":"TEST-429","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2300 - Descarga de deuda","customfield_12404":{"steps":[{"id":806,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Nueva gestión de cartera. Seleccionamos la pestaña Descarga. 2) Seleccionamos la explotación y el propietario cuyas facturas deseamos realizar la descarga en el combo de selección. 3) Seleccionamos una de las opciones para realizar la búsqueda de facturas a incluir en la descarga, por ejemplo la fecha de la factura desde/hasta. 4) Pulsamos crear descarga de deuda con las condiciones indicadas","data":"","result":"3) Se abre la ventana de selección de facturas. 4) Se crea correctamente la operación de cartera de tipo DESCARGA, con estado No definitiva y No Terminada.","attachments":[]},{"id":807,"index":2,"step":"2 - 1) Ir a OC > Gestión de cartera > Operaciones sobre la cartera > Buscar la gestión de carteraDESCARGA del paso anterior (filtrar por fecha desde/hasta y tipo de operación DESCARGA). 2) Seleccionar el registro y pulsar el botón Hacer definitiva","data":"","result":"1) Abrimos el registro y comprobamos en la pestaña Facturas que las facturas no han cambiado de estado IMPAGADA. 2) Abrimos el registro y comprobamos en la pestaña Facturas que las facturas han pasado de estado anterior IMPAGADAa estado anterior DESCARGADA.","attachments":[]}]}}},{"id":264,"testExecKey":"TEST-457","testKey":"TEST-430","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2310 - Recarga de deuda","customfield_12404":{"steps":[{"id":808,"index":1,"step":"1 - 1) Ir a OC > Gestión de cartera > Nueva gestión de cartera. Seleccionamos la pestaña Recarga. 2) Indicamos la fecha desde/hasta de la descarga. Pulsar el botón Buscar 3) Seleccionar la descarga de deuda creada en el paso anterior y pulsar el botón Crear recarga deuda masiva","data":"","result":"2) Se visualizan las descargas de deuda disponibles en el sistema. 3) Se crea la operación de cartera de tipo RECARGA en estado Definitiva y Terminada.","attachments":[]},{"id":809,"index":2,"step":"2 - Ir a OC > Gestión de cartera > Operaciones sobre la cartera > Buscar la gestión de cartera RECARGA del paso anterior (filtrando por tipo de operación RECARGA y por fecha de creación la fecha de la prueba realizada).","data":"","result":"Abrimos el detalle y comprobamos que las facturas han pasado de estado anterior RECARGADAa estado IMPAGADA.","attachments":[]}]}}},{"id":265,"testExecKey":"TEST-457","testKey":"TEST-431","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2400 - Realizar proceso de impagados","customfield_12404":{"steps":[{"id":810,"index":1,"step":"1 - Menú Operativa comercial > Gestión de impagados > Nueva gestión de reclamación > pestaña por contrato Informar el campo procedimiento, con el que hemos elegido anteriormente que está relacionado con un impreso Informar un contrato que tenga facturas impagadas (verificar que en la pantalla de contrato no existe icono de procedimiento de impagados) 1- Botón añadir 2- Seleccionar una o más facturas impagadas Botón aceptar","data":"","result":"1- Muestra una pantalla de selección de facturas impagadas, mostrando todas las facturas impagadas que tiene el contrato 2- Crea una línea en la gestión de reclamación creada en la sesión Su estado es provisional Entrar en la línea y verificar que en la pestaña facturas están todas las facturas seleccionadas por nosotros","attachments":[]},{"id":811,"index":2,"step":"2 - Menú Operativa comercial > gestión de impagados > gestiones de reclamación","data":"","result":"Buscar el procedimiento que acabamos de realizar Verificar que su estado es provisional y que el importe es el sumatorio de los importes de todas las facturas seleccionadas anteriormente","attachments":[]},{"id":812,"index":3,"step":"3 - Ir a uno de los contratos a los que hemos efectuado la gestión de impagados","data":"","result":"Verificar que existe el icono del proceso de reclamación con el nombre del proceso y la fecha de vencimiento","attachments":[]},{"id":813,"index":4,"step":"4 - Menú operativa comercial > gestión de impagados > gestiones de reclamación seleccionar la línea que corresponde a la gestión creada en los pasos anteriores y que su estado es provisional botón aceptar","data":"","result":"Muestra el listado de la gestión que se acaba de realizar Muestra un excel de la gestión que se acaba de realizar El estado de la línea es aceptada","attachments":[]},{"id":814,"index":5,"step":"5 - Entrar en la línea con estado aceptada botón siguiente paso, este botón deberá ejecutarse tantas veces como pasos tenga el procedimiento Ejecución del último paso del procedimiento","data":"","result":"El estado de la línea debe ser acabada","attachments":[]},{"id":815,"index":6,"step":"6 - Botón imprimir cartas","data":"","result":"Impresión de documentos asociados a alguno de los pasos del procedimiento","attachments":[]}]}}},{"id":266,"testExecKey":"TEST-457","testKey":"TEST-432","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2410 - Expediente de recobro","customfield_12404":{"steps":[{"id":816,"index":1,"step":"1 - Menú operativa comercial > Gestión de impagados > Nueva gestión de reclamación > pestaña por contrato Informar el campo procedimiento, con el que hemos elegido anteriormente que esté relacionado con un expediente de recobro Informar un contrato que tenga facturas impagadas (verificar que en la pantalla de contrato no existe icono de procedimiento de impagados ni de expediente de recobro) 1- Botón añadir 2- Seleccionar una o más facturas impagadas Botón aceptar","data":"","result":"1- Muestra una pantalla de selección de facturas impagadas, mostrando todas las facturas impagadas que tiene el contrato 2- Crea una línea en la gestión de reclamación creada en la sesión Su estado es provisional Entrar en la línea y verificar que en la pestaña facturas están todas las facturas seleccionadas por nosotros","attachments":[]},{"id":817,"index":2,"step":"2 - Menú operativa comercial > gestión de impagados > gestiones de reclamación","data":"","result":"Buscar el procedimiento que acabamos de realizar Verificar que su estado es provisional y que el importe es el sumatorio de los importes de todas las facturas seleccionadas anteriormente","attachments":[]},{"id":818,"index":3,"step":"3 - Ir a uno de los contratos a los que hemos efectuado la gestión de impagados","data":"","result":"Verificar que existe el icono del proceso de reclamación con el nombre del proceso y la fecha de vencimiento","attachments":[]},{"id":819,"index":4,"step":"4 - Menú operativa comercial > gestión de impagados > gestiones de reclamación seleccionar la línea que corresponda a la gestión creada en los pasos anteiores y que su estado es provisional Botón aceptar","data":"","result":"Muestra el listado de la gestión que se acaba de realizar Muestra un excel de la gestión que se acaba de realizar El estado de la línea es aceptada","attachments":[]},{"id":820,"index":5,"step":"5 - Entrar en la línea con estado aceptada Botón siguiente paso, este botón deberá ejecutarse tantas veces como pasos tenga el procedimiento Ejecución del último paso del procedimiento","data":"","result":"El estado de la línea debe ser acabada","attachments":[]},{"id":821,"index":6,"step":"6 - Ir a uno de los contratos a los que hemos efectuado la gestión de impagados","data":"","result":"Verificar que ha desaparecido el icono del proceso de reclamación y se ha creado el icono de expediente de recobro","attachments":[]},{"id":822,"index":7,"step":"7 - Menú operativa comercial > gestión de impagados > expediente de recobro Buscar el expediente realizado en los pasos anteriores","data":"","result":"Verificar que se ha creado el expediente con los las facturas e importes seleccionados al ejecutar el proceso de impagados El estado debe ser activo","attachments":[]},{"id":823,"index":8,"step":"8 - Menú operativa de sistema > gestión de servidor > propiedades del servidor","data":"","result":"Verificar que las propiedades dir.GestorCobro.entrada y dis.GestorCobro.salida están dadas de alta","attachments":[]},{"id":824,"index":9,"step":"9 - GENERAR FICHERO DE RECOBRO PARA EL GESTOR Verificar que en la sociedad gestora de la explotación existen los datos del gestor de cobro Menú operativa comercial > gestión de tareas Lanzar la tarea ENVIO FICHERO EXPEDIENTES RECOBRO'","data":"","result":"Verificar que se ha generado el fichero derecobro para el gestor en la carpeta especificada en la propiedad del servidor dir.GestorCobro.Salida Recordar que como subcarpeta tiene el código del gestor y el código de la sociedad gestora de la explotación Verificar que el fichero creado contiene las facturas con los importes seleccionados en el proceso de recobro","attachments":[]},{"id":825,"index":10,"step":"10 - PROCESAR FICHERO RECOBRO DEL GESTOR Una vez el gestor de cobro realiza su tarea y envía el fichero con los resultados obtenidos de su gestión, se debe procesar El fichero debe tener el formato descrito en el caso de uso CU_UTIL_GCAR_Envío-Recepción Fichero Recobros por sociedad'Para que se pueda leer el fichero debe estar colocado en la carpeta informada en la propiedad del servidor dir.GestorCobro.entrada y como subcarpetas el código del gestor, el código de la sociedad gestora de la explotación y subcarpeta import Menú operativa de sistema > gestión de tareas > lanzar la tarea manualmente Lanzar la tarea 'RECEPCIÓN FICHEROS EXPEDIENTES RECOBRO'","data":"","result":"Se procesa correctamente Verificar que el fichero importado ha sido eliminado de la subcarpeta importe y está en la subcarpeta backup","attachments":[]},{"id":826,"index":11,"step":"11 - Menú Operativa comercial > gestión de impagados > expedientes de recobro Seleccionar el expediente de cobro en el que hemos estado trabajado","data":"","result":"Su estado debe ser cerrado y como motivo de finalización el que se haya importado en el fichero","attachments":[]}]}}},{"id":267,"testExecKey":"TEST-457","testKey":"TEST-433","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2420 - Gestión de reclamación con recargo","customfield_12404":{"steps":[{"id":827,"index":1,"step":"1 - Menú Operativa comercial > Gestión de impagados > Nueva gestión de reclamación > pestaña por contrato? Informar el campo procedimiento, con el que hemos elegido anteriormente que tenga informado un % de recargo Informar un contrato que tenga facturas impagadas 1- Botón añadir 2- Seleccionar una o más facturas impagadas Botón aceptar","data":"","result":"1- Muestra una pantalla de selección de facturas impagadas, mostrando todas las facturas impagadas que tiene el contrato 2- Crea una línea en la gestión de reclamación creada en la sesión Su estado es provisional Entrar en la línea y verificar que en la pestaña facturas están todas las facturas seleccionadas por nosotros","attachments":[]},{"id":828,"index":2,"step":"2 - Menú operativa comercial > gestión de impagados > gestiones de reclamación","data":"","result":"Buscar el procedimiento que acabamos de realizar Verificar que su estado es provisional y que el importe es el sumatorio de los importes de todas las facturas seleccionadas anteriormente","attachments":[]},{"id":829,"index":3,"step":"3 - Seleccionar la línea que corresponde a la gestión creada en los pasos anteriores y que su estado es provisional Botón aceptar","data":"","result":"Muestra el listado de la gestión que se acaba de realizar muestra un excel de la gestión que se acaba de realizar el estado de la línea es aceptada","attachments":[]},{"id":830,"index":4,"step":"4 - Entrar en la línea con estado aceptada botón siguiente paso, este botón deberá ejecutarse tantas veces como pasos tenga el procedimiento Ejecución del último paso del procedimiento","data":"","result":"El estado de la línea debe ser acabada","attachments":[]},{"id":831,"index":5,"step":"5 - Menú operativa comercial > contratación > procesos de contratación > contratos seleccionar el contrato al que se le ha hecho el proceso de impagado Ir a la pestaña facturación","data":"","result":"Comprobar que las facturas a las que hemos hecho el proceso de impagados continuan en estado impagadas y en la columna recargo está informado el importe de la factura que está impagada aplicándole el % de recargo","attachments":[]},{"id":832,"index":6,"step":"6 - botón cobro de facturas Proceder a cobrar la factura con recargo","data":"","result":"El campo importe debe ser la suma de la factura inicial más el % de recargo calculado El estado de la factura queda cobrada","attachments":[]},{"id":833,"index":7,"step":"7 - Botón ciclo Pestaña facturación acceder al detalle de factura pestaña recargo","data":"","result":"Comprobar que los datos de esta pantalla se corresponden con los obtenidos en el proceso de reclamación y cobro de la factura","attachments":[]}]}}},{"id":268,"testExecKey":"TEST-457","testKey":"TEST-434","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2500 - Quejas","customfield_12404":{"steps":[{"id":834,"index":1,"step":"1 - 1) Ir a OC > Gestión de contactos > Quejas. 2) Pulsar en el botón Añadir.Señalar la explotacióny pulsar el botón Aceptar Motivo inicial. Via comunicación. Persona contacto o Contrato Primera respuesta al cliente","data":"","result":"1) Se abre la ventana de detalle de queja. 2) Se registra correctamente la queja en el sistema. El estado de la queja debe ser registrada","attachments":[]},{"id":835,"index":2,"step":"2 - 1) Buscar la queja que acabamos de dar de alta Entrar en ella 2) Mediante el botón transferir, transferir la queja al departamento correspondiente 3) Una vez transferida, nos pedirá la impresión de la primera respuesta Marcar el si","data":"","result":"1) Debe existir una línnea en la pestaña acciones de tipo registro 2) Se debe crear una línea en la pestaña acciones de tipo transferencia 3) Verificar que el testo que hemos dado de alta en el campo primera respuesta al cliente, sale reflejado en el documento El estado de la queja debe ser transferida","attachments":[]},{"id":836,"index":3,"step":"3 - 1) entrar en la pestaña actuación y añadir una 2) Botón resolver rellenar los campos necesarios, salvar Informar el campo resolución al cliente 3) botón impr. resolución","data":"","result":"1) Debe visualizarla en la pestaña de actuación 2) En la pestaña acciones, ha creado un registro de tipo resolución 3) verificar que el literal informado en el campo resolución al cliente sale reflejado en el documento El estado de la queja debe ser resuelta","attachments":[]}]}}},{"id":269,"testExecKey":"TEST-457","testKey":"TEST-435","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2600 - Juicios","customfield_12404":{"steps":[{"id":837,"index":1,"step":"1 - Ir a OC > Gestión de facturación > Proceso de facturación > Facturas > Pestaña Criterio combinado. Realizamos una búsqueda de facturas impagadas y tomamos nota del número de contrato. Seleccionamos una fecha de inicio y fin. En el campo estado seleccionamos IMPAGADA","data":"","result":"Paso previo","attachments":[]},{"id":838,"index":2,"step":"2 - 1) Ir a OC > Gestión de cartera > Nueva gestión de cartera. Seleccionamos la pestaña Juicio. 2) Seleccionamos como origen del juicio: Contrato 3) Seleccionar la explotación del contrato a buscar Pulsamos el botón Seleccionar en el campo Contrato y buscamos el contrato que hemos apuntado en el paso anterior. 4) Pulsamos el botón Crear Juicio Interno. 5) Pulsamos el botón Aceptar.","data":"","result":"4) Paso previo. Se abre la ventana de selección de facturas. 5) Se abre la ventana Detalle de Gestión de cartera. Se crea la nueva operación de cartera de tipo JUICIO, con estado No definitiva y No terminada. Las facturas pasan de estado IMPAGADA a BLOQUEADA.","attachments":[]},{"id":839,"index":3,"step":"3 - 1) Ir a OC > Gestión de cartera > Operaciones sobre la cartera > Buscar la gestión de cartera JUICIO del paso anterior (operación BLOQUEOcon estado No defintivo y No terminado). 2) Seleccionar el registro y pulsar el botón Hacer definitiva 3) Abrir el cargojuiciopara ver el detalle de la operación y pulsar sobre el botón Liquidar. 4) Seleccionar la/s factura/s a cobrar en la liquidación del cargo y pulsamos el botón Seleccionar ciclos a cobrar. 5) Seleccionar la forma de pago y pulsar el botón Añadir cobro. 6) Pulsar Aceptar.","data":"","result":"2) Se imprime un pdf con el detalle de la operación. 3) Se abre la pantalla de pago de Facturas. 5) Se añade el cobro en el panel Pagos realizados. 6) Se liquida el compromiso correctamente. Se crea una operación de cartera de tipo CARGO VARIOS y tipo operación COBRO. La factura cambia de estado BLOQUEADA a COBRADA.","attachments":[]},{"id":840,"index":4,"step":"4 - Repetir los pasos anteriores para el caso Crear Juicio Externo.","data":"","result":"","attachments":[]}]}}},{"id":270,"testExecKey":"TEST-457","testKey":"TEST-436","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2700 - Dotación a morosos/Amortización","customfield_12404":{"steps":[{"id":841,"index":1,"step":"1 - DOTACIÓN A MOROSOS Menú contabilidad y finanzas > control finanzas > dotación a morosos > pestaña dotación a morosos Seleccionar criterios para indicar las facturas a incluir en la dotación botón dotación provisional","data":"","result":"Se genera la dotación correctamente","attachments":[]},{"id":842,"index":2,"step":"2 - botón cargar dotación seleccionar un contrato > pestaña facturación seleccionar un contrato > Pestaña cartera","data":"","result":"verificar que el contrato mostrado tiene la factura seleccionada en estado impagada Verificar que en el contrato se ha creado una línea con finalizada NO, tipo dotación a morosos, definitiva no y operación dotación a morosos","attachments":[]},{"id":843,"index":3,"step":"3 - Menú operativa comercial > gestión de cartera > operaciones sobre la cartera Buscar la dotación que acabamos de crear","data":"","result":"Se muestra una línea con la columna operación informada como dotación a morosos, columna tipo de gestión informada como dotación a morosos, columna finalizada informada como no y en la descripción informa Ensayo","attachments":[]},{"id":844,"index":4,"step":"4 - Volver a la pantalla de dotación a morosos Informar el campo año de dotación Botón dotación definitiva","data":"","result":"Se genera la dotación correctamente","attachments":[]},{"id":845,"index":5,"step":"5 - Ir a un contrato de los contenidos en la dotación pestaña facturación pestaña cartera","data":"","result":"verificar que el contratosigue teniendo la factura seleccionada en estado impagada Verificar que en el contrato se ha creado una línea con finalizada SI, tipo dotación a morosos, definitivaSI y operación dotación a morosos","attachments":[]},{"id":846,"index":6,"step":"6 - Volver al menú operaciones sobre la cartera","data":"","result":"Se muestra una línea con la columna operación informada como dotación a morosos, columna tipo de gestión informada como dotación a morosos, columna finalizada informada comosi y en la descripción no informa Ensayo","attachments":[]},{"id":847,"index":7,"step":"7 - AMORTIZACIÓN Menú operativa comercial > gestión de cartera > Nueva gestión de cartera > pestaña amortización Seleccionar por los campos que nos devuelvan los datos utilizados anteriormente en la dotación a morosos botón crear ensayo","data":"","result":"Mensaje de que la tarea de generar amortización masiva ha finalizado con éxito","attachments":[]},{"id":848,"index":8,"step":"8 - menú operativa comercial > informes e indicadores> resultados de procesos Buscar el proceso que se acaba de ejecutar y que el tipo es informe de amortización por sociedad gestora entrar en la línea seleccionada botón visualizar","data":"","result":"Se abre un excel con los datos de la amortización Verificar que las facturas a las que hemos hecho la dotación por las mismas fechas están contenidas en este excel","attachments":[]},{"id":849,"index":9,"step":"9 - Si es correcto el excel obtenido ir otra vez a la pestaña de amortización botón crear amortización","data":"","result":"se ejecuta correctamente en la pestaña gestiones de la sesión ha creado una línea nueva con operación bloqueada, tipo de gestión amortización y definitiva No","attachments":[]},{"id":850,"index":10,"step":"10 - Menú operativa comercial > gestión de cartera > operaciones sobre la cartera","data":"","result":"se ha creado una línea con operación bloqueada, tipo de gestión amortizació, finalizada no y definitiva no Verificar que están todas las facturas que nos ha mostrado el excel anterior Al entrar en la pestaña facturas, el estado anterior debe ser impagada","attachments":[]},{"id":851,"index":11,"step":"11 - Ir a uno de los contratos prestaña facturación pestaña cartera","data":"","result":"el periodo amortizado aparece en color verde y con estado bloqueado se ha creado una línea nueva con finalizado no, tipo amortizado, definitiva no, operación bloqueo y descripción amortización","attachments":[]},{"id":852,"index":12,"step":"12 - Teniendo marcada la operación de amortización en el menú de operaciones de cartera botón hacer definitiva","data":"","result":"La línea ha quedado como finalizada y definitiva Al entrar en la pestaña facturas, el estado anterior debe ser impagada","attachments":[]},{"id":853,"index":13,"step":"13 - Ir a uno de los contratos pestaña facturación pestaña cartera","data":"","result":"el periodo amortizado aparece en color negro y con estado amortizada la líneaha quedadocon finalizado si, tipo amortizado, definitiva si, operaciónamortización y descripción amortización","attachments":[]}]}}},{"id":271,"testExecKey":"TEST-457","testKey":"TEST-437","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2800 - Generación de órdenes de corte de suministro para impagados","customfield_12404":{"steps":[{"id":854,"index":1,"step":"1 - Menú operativa comercial > gestión de órdenes de servicio > ordenes de corte para plazos impagados Seleccionar las fechas o no seleccionar nada botón crear","data":"","result":"Debe acabar la tarea órdenes de corte para plazos impagados correctamente","attachments":[]},{"id":855,"index":2,"step":"2 - Menú operativa comercial > gestión de órdenes de servicio > órdenes Buscar por tipo corte de suministro","data":"","result":"Debe crear órdenes de todos los contratos con plazos impagados que cumplan las fechas seleccionadas anteriormente El estado de la orden debe ser en curso El motivo debe ser plazos impagados El tipo debe ser corte de suministro","attachments":[]},{"id":856,"index":3,"step":"3 - Menú Operativa comercial > gestión de órdenes de servicio > certificador de órdenes Informar todos los campos de esta pantalla botón certificar Añadir la última lectura botón insertar lecturas botón certificar","data":"","result":"Ejecuta correctamente","attachments":[]},{"id":857,"index":4,"step":"4 - Menú operativa comercial > gestión de órdenes de servicio > órdenes Buscar la orden que se acaba de certificar","data":"","result":"El estado debe ser acabada","attachments":[]},{"id":858,"index":5,"step":"5 - Menú operativa comercial > contratación > procesos de contratación > Contratos buscar el contrato al que acabamos de efectuar la orden de cierre de suministro","data":"","result":"Aparece el icono de punto de servicio cortado con la fecha de la acción del corte","attachments":[]},{"id":859,"index":6,"step":"6 - Realizar los mismos procesos con una explotación que esté conectada con GOT","data":"","result":"","attachments":[]}]}}},{"id":272,"testExecKey":"TEST-457","testKey":"TEST-438","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2810 - Reposición de servicio cortado","customfield_12404":{"steps":[{"id":860,"index":1,"step":"1 - Tomar el contrato que en el paso anterior hemos cortado el suministro por impago de facturas Menú operativa comercial > contratación> proceso de contratación > contrato > pestaña facturación Botón facturar la reposición Seguir los pasos habituales para el cobro de una factura contestar queNO a la pregunta de si se quiere reponer el servicio","data":"","result":"Hace una factura deorigenotros de la reposición con estado cobrada","attachments":[]},{"id":861,"index":2,"step":"2 - Dentro del contrato y en la pestaña facturación botón reponer","data":"","result":"Ejecuta correctamente","attachments":[]},{"id":862,"index":3,"step":"3 - Menú operativa comercial > gestión de oódenes de servicio > órdenes","data":"","result":"Debe existir una orden de reposición de suministro que se acaba de crear al contrato","attachments":[]},{"id":863,"index":4,"step":"4 - Menú operativa comercial > gestión de ordenes de servicio > certificador de ordenes rellenar todos los campos botón certificar informar lecturas botón insertar lecturas botón certificar","data":"","result":"Ejecuta correctamente","attachments":[]},{"id":864,"index":5,"step":"5 - Menú Operativa comercial > gestión de órdenes de servicio > órdenes Buscar la orden que acabamos de certificar con motivo reposición de suministro","data":"","result":"El estado debe ser acabado","attachments":[]},{"id":865,"index":6,"step":"6 - Menú operativa comercial > contratación > proceso de contratación > contratos buscar el contrato de los pasos anteriores","data":"","result":"Ha desaparecido el mensaje de corte de suministro","attachments":[]},{"id":866,"index":7,"step":"7 - Realizar los mismos procesos con una explotación que esté conectada con GOT","data":"","result":"","attachments":[]}]}}},{"id":273,"testExecKey":"TEST-457","testKey":"TEST-439","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2900 - Crear Pago Plano","customfield_12404":{"steps":[{"id":867,"index":1,"step":"1 - Seleccionar explotación cuya sociedad propietaria tenga activado Pago Plano. Verificar en pantalla [Datos Maestro > Datos Maestro Cartera > Permiso sobre Cartera de Propietarios > Pestaña Tipo de Gestión de Cartera Permitidos'] tenga Pago Plano como una de la gestiones permitidas. Nota: En una Explotación que tenga varias sociedades propietarias, sólo al tener una de ellas 'Pago Plano'activado, ya se puede aplicar dicha modalidad.'","data":"","result":"En la pantalla [Operativa Comercial > Contratación > Proceso de Contratación > Contratos > Pestaña Facturación] tiene habilitado botón Crear Plan de Pago'y al hacer clic, no aparece validación 'La sociedad Propietaria de la cartera NO permite las gestiones de cartera de tipo Pago Plano'.'","attachments":[]},{"id":868,"index":2,"step":"2 - Bucar contrato que cumpla requisitos para poder dar de alta pago plano. Ver condiciones en el Caso de Uso CU_UTIL_CONS_Consultar Detalle Contrato'. A tener en cuenta: No es posible crear un plan de pago sobre el contrato debido a que éste no cumple las siguientes condiciones exigidas : El estado del contrato no es “ALTA”. Existe un proceso de contratación de “BAJA” o de “CAMBIO DE TITULAR” en curso. El punto de servicio está “CORTADO”. Existe un plan de pago “activo” definido para este contrato. El contrato tiene facturas o plazos diferidos. La periodicidad del contrato es “MENSUAL”. El contrato no incluye el concepto “AGUA” en la factura. El contrato no tiene los meses de antigüedad mínima exigida [XX]. La seña de cobro del contrato no es bancaria. El titular del contrato no es el pagador del mismo. No se dispone de una lectura real en el último año. El contrato tiene facturas impagadas. El contrato ha tenido fraude el último año.'","data":"","result":"En la pantalla [Operativa Comercial > Contratación > Proceso de Contratación > Contratos > Pestaña Facturación] tiene habilitado botón Crear Plan de Pago'y al hacer clic, aparece ventana 'Crear Plan de Pago'. En dicha pantalla aparecen las facturas tratadas, en base a las cuales se calcula la cuota del plan.'","attachments":[]},{"id":869,"index":3,"step":"3 - Hacer clic en el botón aceptar'de la pantalla 'Crear Plan de Pago'","data":"","result":"Al hacer clic en la ventana Crear Plan de Pago', se confirma la creación del plan y se genera el documento impreso 'Documento Adhesión modalidad pago 12 gotas'. Nota: El documento se crea en este punto siempre y cuando en la pantalla [Datos Maestros > Explotación > Seleccionar Explotación > Pestaña Operaciones de Cartera > Subpestaña Planes de Pago] esté marcado el CHECK 'Imprimir directamente la documentación'. Verificar que se ha creado el icono correspondiente de Pago Plano dentro del contrato. Dentro del contrato, en la pestaña Cartera verificar que se ha creado una operación de bloqueo de tipo Pago Plano. '","attachments":[]}]}}},{"id":274,"testExecKey":"TEST-457","testKey":"TEST-440","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2910 - Facturar Ciclo con Pago Plano activo","customfield_12404":{"steps":[{"id":870,"index":1,"step":"1 - Localizar contrato con Pago Plano activo.","data":"","result":"Contrato tiene operación bloqueo de tipo Pago Plano.","attachments":[]},{"id":871,"index":2,"step":"2 - Avanzamos un ciclo de facturación a través del Facturador Periódico, donde esté incluido el contrato con el Pago Plano'activo.'","data":"","result":"Se genera factura en estado Bloqueada'.'","attachments":[]},{"id":872,"index":3,"step":"3 - Entrar a la gestión de Pago Plano', a través del Icono 'Pago Plano'.'","data":"","result":"Verificamos en la zona Facturas del Periodo consta la factura generada.","attachments":[]}]}}},{"id":275,"testExecKey":"TEST-457","testKey":"TEST-441","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2920 - Abonar Factura generada incluida en Pago Plano","customfield_12404":{"steps":[{"id":873,"index":1,"step":"1 - Localizar Pago Plano activo que tenga factura bloqueada generada. Situarse en la pestaña Facturación del contrato. Seleccionar la factura y hacer clic en el botón ciclo'. Hacer clic en el botón 'abonar'. Seleccionar la causa del abono y terminar el proceso de abono de la factura. Nota: Se puede utilizar factura generada enPR anterior.'","data":"","result":"5. La factura Bloqueada cambia a estado Abonada'. Se crea la consiguiente Factura de Abono. En la Gestión de Cartera de Pago Plano > Pestaña General, enla zona 'Facturas del periodo', constan tanto la factura abonada como la factura de abono.'","attachments":[]}]}}},{"id":276,"testExecKey":"TEST-457","testKey":"TEST-442","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2930 - Cobrar cuota de Pago Plano","customfield_12404":{"steps":[{"id":874,"index":1,"step":"1 - Ir a la pantalla [OC > Gestión de Cartera > Nueva Gestion de Cartera > Pestaña Remesa], informar fecha actual y hacer clic en Generar Remesa'.'","data":"","result":"Se genera la remesa correspondiente que incluye el pago de la cuota del Pago Plano. Se puede visualizar en la pantalla [OC > Gestión de Cartera > Operaciones sobre la Cartera > General] la remesa generada en No definitiva'y 'No terminada'.'","attachments":[]},{"id":875,"index":2,"step":"2 - Ir a la pantalla [OC > Gestión de Cartera > Operaciones sobre la Cartera > General], seleccionar la remesa creada y hacer clic en el botón Hacer Definitiva'.'","data":"","result":"La operación cambia a operación terminada y definitiva. Volver al contrato, dentro del pago plano, pestaña Pago Plano y comprobar que la cuota aparece como Realizada. Verificar en el contrato, en la pestaña cartera que la operación de Bloqueo de Pago Plano, aparece como no terminada.","attachments":[]}]}}},{"id":277,"testExecKey":"TEST-457","testKey":"TEST-443","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2940 - Devolución Cuota Pago Plano","customfield_12404":{"steps":[{"id":876,"index":1,"step":"1 - Dentro del contrato en la pestaña Cartera, seleccionar la Operación de Pago Plano y entrar en la pestaña, Desglose de Pagos Operación'. Seleccionar la cuota cobrada y hacer clic en el botón 'Devolver cobro plazo'. Aceptar la devolución.'","data":"","result":"Se devuelve la cuota quedando la columna Devuelto'con valor 'Sí'. Se genera una contrapartida negativa (devolución) y otra positiva (cuota que vuelve a quedar pendiente). Se genera documento de devolución por el concepto Plan de Pago (Devolución cuota Plan 12 Gotas).'","attachments":[]}]}}},{"id":278,"testExecKey":"TEST-457","testKey":"TEST-444","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-2950 - Finalizar Plan de Pago","customfield_12404":{"steps":[{"id":877,"index":1,"step":"1 - Ir a la pantalla [OC > Contratación > Proceso de Contratación > Contratos > Icono Pago Plano] de un contrato que tenga un Pago Plano'activo y no finalizado. Hacer clic en el botón Finalizar. Confirmar la finalización del Pago Plano. Nota: Se puede seleccionar el contrato de la prueba de regresión anterior 'Devolución Cuota Pago Plano'.'","data":"","result":"Al volver a entrar en el contrato, el icono Pago Plano ya no está. En la pestaña Cartera'del contrato, la operación de Pago Plano aparece Terminada y Definitiva. Si la suma de las cuotas pagadas es = o > Factura bloqueada, se compensa con la factura, y el restante queda como saldo a favor del cliente, pendiente de ser devuelto o compensado. '","attachments":[]}]}}},{"id":279,"testExecKey":"TEST-457","testKey":"TEST-445","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-3000 - Utilización de Sc ner y Alfresco (Gestor documental)","customfield_12404":{"steps":[{"id":878,"index":1,"step":"1 - AÑADIR DOCUMENTO 1) Operativa comercial > Contratación > proceso de contratación > contratos > buscar un contrato > botón imagen > botón configurar escàner > seleccionar el escàner > seleccionar tipo de documento 2) Botón añadir 3) Marcar el indicador de Cristal, y el icono Añadir una página en color 4) Botón scanear 5) Salir de ScanGear","data":"","result":"2) Se abre el diálogo del scáner 3) Se abre el ScanGear 5) En el panel de consulta de documentos escaneados tiene que aparecer el documento que acabamos de escanear, con el nombre del tipo de documento que hemos seleccionado y la fecha y hora del escaneo","attachments":[]},{"id":879,"index":2,"step":"2 - CONSULTAR DOCUMENTO 1) Volver a entrar en el contrato y al botón de imagen 2) Posicionarse en el documento que hemos escaneado y dar al botón consultar","data":"","result":"2) Se visualiza el documento","attachments":[]},{"id":880,"index":3,"step":"3 - IMPRIMIR DOCUMENTO 1) Volver a entrar en el contrato y al botón de imagen 2) Posicionarse en el documento que hemos escaneado y dar al botón imprimir","data":"","result":"2) Se imprime el documento","attachments":[]},{"id":881,"index":4,"step":"4 - ELIMINAR DOCUMENTO 1) Volver a entrar en el contrato y al botón imagen 2) Posicionarse en el documento que hemos escaneado y dar al botón eliminar","data":"","result":"2) Desaparece el documento de la consulta de documentos escaneados","attachments":[]},{"id":882,"index":5,"step":"5 - ASOCIAR DOCUMENTO 1) Volver a entrar en el contrato y al botón imagen 2) Elegir un tipo de documento y dar al botón asociar Seleccionar un fichero","data":"","result":"2) En el panel de consulta de documentos escaneados tiene que aparecer el documento que hemos asociado, con el nombre del tipo de documento que hemos seleccionado y la fecha y la hora de la asociación","attachments":[]},{"id":883,"index":6,"step":"6 - MODIFICAR IMAGEN 1) Volver a entrar en el contrato y al botón imagen 2) Posicionarse en el documento que tenemos asociado al contrato y dar al botón modificar 3) Marcar el indicador de Cristal, y el icono Añadir una página en color contestar a la pregunta de si se quiere insertar al principio 4)Botón digitalizar 5) Salir de ScanGear","data":"","result":"2) Se abre el diálogo del scáner 3) Se abre el ScanGear 4) Incorporará el documento donde se haya elegido, después debe modificarse la hoja antigua, por ejemplo, eliminándola 5) En el panel de consulta de documentos escaneados tiene que aparecer el documento que habíamos seleccionado, con la fecha y hora de la modificación del escaneo","attachments":[]}]}}},{"id":280,"testExecKey":"TEST-457","testKey":"TEST-446","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-4000 - WS de MDM","customfield_12404":{"steps":[{"id":884,"index":1,"step":"1 - Si se ha modificado algún WS del grupo InterfazGenericaContadoresWS: getCambiosContadorDeContrato actualizarContador getPuntoServicioPorContador getContador","data":"","result":"Avisar al grupo de MDM para que prueben el WS","attachments":[]}]}}},{"id":281,"testExecKey":"TEST-457","testKey":"TEST-447","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-5000 - Proceso de Comunicación","customfield_12404":{"steps":[{"id":885,"index":1,"step":"1 - Carta (STREAMSERVE) Envio masivo y email Ir a la pantalla Tipos de documento [Datos Maestros > Datos maestros Comercial > Datos Maestros Impresión y distribución]. Buscamos un documento que tenga tanto plantilla para carta como plantilla de mail (ej: recordatorio de pago). Acceder al documento y verificar que tiene rellenado Plantilla'y 'Plantilla E_Mail'. Verifica que está marcado el check 'Impresión externa'","data":"","result":"Datos previos","attachments":[]},{"id":886,"index":2,"step":"2 - Ir a la pantalla Lineas de Distribución [Datos Maestros > Datos maestros Comercial > Datos Maestros Impresión y distribución]. Buscar la linea distribución de la explotación Activa'y modificar. Ir a la pestaña rutas y escoger la ruta donde tiene que ir la carta (ej 'nacional') , se selecciona y se clica a modificar. En el 'detalle ruta distribución', ir a pestaña 'tipo de documento', verificar que consta el documento (en nuestro caso 'recordatorio de pago') que vamos a generar, sino añadir. En el caso de 'añadir', verificar 'c.distribución principal'= Cartas envio masivo Hacer doble clic en el documento y en la pantalla 'Asignar Tipo de Documento a Ruta'verificar que tipo de carta genera. En nuestro caso marcaremos 'Carta certificada'.'","data":"","result":"Datos previos","attachments":[]},{"id":887,"index":3,"step":"3 - Ir a la pantallaDetalle de Explotación'[Datos Maestros > Explotación y hacer doble clic a la explotación que nos interesa]. Is a Pestaña Comunicaciones. Verificar que en la grid del panel inferior consta el documento que vamos a procesar (ej: Recordatorio de pago). En el caso que no conste, añadirlo. Tienen que estar marcado 'Emitir carta'y también tiene que estar marcado el check 'Emitir e-mail'.'","data":"","result":"Datos previos","attachments":[]},{"id":888,"index":4,"step":"4 - Ir a la pantalla Nueva gestión de reclamación', [OC> Gestión de impagados]. Seleccionar un procedimiento, el cual contenga un paso con 'carta recordatorio de pago', incluida. '","data":"","result":"Se genera la reclamación en estado provisional, se puede visualizar en el panel superior.","attachments":[]},{"id":889,"index":5,"step":"5 - Seleccionar la reclamación y hacemos clic a modificar. Procedemos a modificar contrato para que al menos 1 se envie carta y otro genere mail. Dentro de la reclamación ir a la pestaña contrato. Modificar el contrato según:","data":"","result":"La reclamación pasa de estado provisional'a 'Aceptada' Se crea el proceso de comunicación correspondiente. Se se entra en la reclamación, en la pestaña 'General 'se visualiza el botón 'Proceso de Comunicación'activado.'","attachments":[]},{"id":890,"index":6,"step":"6 - Ir a la pantalla Procesos de Comunicación'[Operactiva Comericial > Comunicaciones]. Nota: También se puede entrar en el proceso de comunicación a través del botón 'Proceso de Comunicación'de la pestaña 'General'de la 'Reclamación. Buscar la comunicación creada previamente en la reclamación. Recomendación : filtrar por la fecha actual para acotar la búsqueda. En el caso de esta en estado 'generada comunicaciones', seleccionar y hacer clic en 'imprimir cartas'para generar las comunicaciones ya sea carta, email o sms-. '","data":"","result":"Aparece la comunicación generada en la reclamación en estado Finalizado'.'","attachments":[]},{"id":891,"index":7,"step":"7 - Hacer clic sobre el proceso de comunicación y dirigirse a la pestaña cartas'","data":"","result":"Visualizamos los registro de las cartas generadas.","attachments":[]},{"id":892,"index":8,"step":"8 - Hacer doble clic sobre la carta generada. En la pantalla Carta Detalle'hacer clic en el botón reimprimir.'","data":"","result":"Se visualiza una copia de la carta generada anteriormente.","attachments":[]},{"id":893,"index":9,"step":"9 - Hacer clic sobre el proceso de comunicación y dirigirse a la pestaña email","data":"","result":"Visualizamos los registro de los emails generados.","attachments":[]},{"id":894,"index":10,"step":"10 - Hacer doble clic sobre el email generado. En la pantalla email detalle'hacer clic en el boton 'ver email'","data":"","result":"Se visualiza el email enviado.","attachments":[]}]}}},{"id":282,"testExecKey":"TEST-457","testKey":"TEST-448","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-6000 - SII Sistema Inmediato de información (AEAT) : Generación Lotes","customfield_12404":{"steps":[{"id":895,"index":1,"step":"1 - Pruebas de Generación de Lote Acceder al punto de menú de [Datos maestros > parámetros funcionales]","data":"","result":"Existe el parámetro funcional PRESENTACION_SII' cuyos valores posibles son: 1: Conexión directa con AEAT (valor por defecto) 2: Plataforma SII'","attachments":[]},{"id":896,"index":2,"step":"2 - Configurar el parámetro funcional 'PRESENTACION_SII' con valor 1 (requiere reiniciar servidor). \nvalor 1 = Envio directo Aeat. \nValor 2 = Envio a través de la plataforma.","data":"","result":"Parametrización para pruebas.","attachments":[]},{"id":897,"index":3,"step":"3 - Acceder al detalle de sociedad propietaria [Datos maestros > Explotaciones >Pestaña Facturación'> Subpestaña 'Generación de facturas'> Hacer doble clic sobre propietario de cartera en el grid 'Propietarios de cartera']'","data":"","result":"Se visualiza el nuevo campo S/N Presentar SII a AEAT': - Se habilita sólo cuando se ha selecciona un valor en 'Tipo lote SII' - Por defecto se asigna el valor - S cuando se selecciona ‘Propio’ como ‘Tipo lote SII’ - N en el resto de casos Las modificaciones en este campo se registran en el histórico de cambios.'","attachments":[]},{"id":898,"index":4,"step":"4 - Acceder al detalle de varias sociedades propietarias [Datos maestros > Explotaciones > Facturación > Generación de facturas > Propietarios de cartera] y realizar la siguiente configuración: a) Presentar SII a AEAT' con valor S y 'Tipo lote' con valor 'Propio' b) 'Presentar SII a AEAT' con valor S y 'Tipo lote' con valor 'Ajeno' c) 'Presentar SII a AEAT' con valor S y 'Tipo lote' con valor 'De tercero' d) 'Presentar SII a AEAT' con valor N y 'Tipo lote' con valor 'Propio' e) 'Presentar SII a AEAT' con valor N y 'Tipo lote' con valor 'Ajeno' f) 'Presentar SII a AEAT' con valor N y 'Tipo lote' con valor 'De tercero' Asegurar que existen facturas de todas las sociedades pendientes de presentar SII y lanzar la tarea 'Generación lotes SII'","data":"","result":"Los lotes SII de la sociedad propietaria se crean en las carpetas: a) \\ENTRADA_AEAT\\ b) \\ENTRADA_AEAT\\ c) \\ENTRADA_AEAT_\\ + código de sociedad d) \\ENTRADA\\ e) \\ENTRADA\\ f) \\ENTRADA_\\ + código de sociedad","attachments":[]},{"id":899,"index":5,"step":"5 - La ubicación de los lotes que se generaran en las diferentes casuísticas vendrá dada por: [BASE]\\[SISTEMACOMERCIAL]\\[CARPETA_ENTRADA]\\ Donde cada valor se obtendrá en función de la configuración de la sociedad propietaria: • SISTEMACOMERCIAL: Siempre será el valor del parámetro funcional SIST_COMERCIAL_LOTE_SII • BASE: Se obtendrá en función del valor del campo Tipo de lote: o Ajeno: propiedad del servidor para lotes ajenos (dir.LoteSIIAjeno) o De terceros: propiedad del servidor para lotes propios (dir.LoteSIIPropio) o Propio: propiedad del servidor para lotes propios (dir.LoteSIIPropio) • CARPETA_ENTRADA: Será distinta en función del valor del campo Presentar SII a AEAT: o Valor N: será la carpeta “ENTRADA” o Valor S: será la carpeta “ENTRADA_AEAT” Para las sociedades cuyo tipo de lote sea ‘De terceros’, además se concatenará con “_” + código de sociedad propietaria. El nombre de los lotes: A. Para Lotes Propios y Ajenos: [NIF]#[TIPO_LIBRO]#[SISTEMACOMERCIAL]#[IDENTIFICADOR_UNICO_SC].xml Ejemplo “A123456789#LRFE-FESU#CF_SECTOR#123456.xml” B. Para Lotes de Terceros: Se añade el Código de la sociedad propietaria al nombre del lote. [NIF]#[TIPO_LIBRO]#[SISTEMACOMERCIAL_CODIGOSOCIEDAD]#[IDENTIFICADOR_UNICO_SC].xml Ejemplo “A123456789#LRFE-FESU#CF_SECTOR_Y234#123456.xml” Donde: NIF emisor: NIF de la sociedad propietaria. Tipo de Libro: LRFE-FESU Sistema Comercial: Nuevo parámetro a nivel de implantación. En Sector será CF_SECTOR. (Mismo que en la ubicación de las carpetas) ID Lote: Identificador del lote en AquaCIS.","data":"","result":"Datos previos","attachments":[]},{"id":900,"index":6,"step":"6 - Generar facturas periódicas que contengan facturas de los propietarioa anteriormente parametrizado acorde a las combinaciones del punto anterior","data":"","result":"Se generan las facturas.","attachments":[]},{"id":901,"index":7,"step":"7 - Lanzar manualmente la tarea GENERACIÓN LOTES SII sin parámetros.","data":"","result":"Según la estructura de carpetas. Se crean lotes de Alta con las facturas que se hayan hecho definitivas desde la fecha de última ejecución de la tarea (que no hayan sido incluídas ya en algún lote). Se crearán lotes de modo que: - un lote no puede contener facturas de más de una explotación - un lote no puede contener facturas de más de un propietario - un lote no puede contener más facturas que las indicadas por el parámetro funcional TAM_MAX_LOTE_SII (por defecto 10.000) Un lote puede ser Propio, Ajeno o de Terceros. Los tres tipos de lotes se generan del mismo modo, pero los ficheros generados se dejan en distinta ubicación y con distinto nombre. Serán de un tipo u otro según lo parametrizado en el propietario de las facturas incluídas en el lote.","attachments":[]},{"id":902,"index":8,"step":"8 - Ir a la pantalla Lotes SII [Contabilidad y Finanzas > Contabilidad]","data":"","result":"Verificar lo lotes creados.","attachments":[]},{"id":903,"index":9,"step":"9 - Acceder al detalle del lote > Pestaña Facturas Seleccionar una o varias facturas y hacer clic en Marcar para reenvio.","data":"","result":"La factura cambia a Estado inicial Validada'.'","attachments":[]},{"id":904,"index":10,"step":"10 - Ir a la pantalla Incidencias SII Facturas'[Contabilidad y Finanzas > Contabilidad]. Efectuar búsqueda sin filtros.'","data":"","result":"Se visualizaran las facturas marcadas en la prueba anterior en estado validada","attachments":[]}]}}},{"id":283,"testExecKey":"TEST-457","testKey":"TEST-449","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-6010 - SII SIstema Inmediato de Información (AEAT) : Recepción Respuestas","customfield_12404":{"steps":[{"id":905,"index":1,"step":"1 - Comprobar que la implantación trabaja con envío directo. Parámetro funcional FACTURA PRESENTACION_SII = 1","data":"","result":"Preparación prueba","attachments":[]},{"id":906,"index":2,"step":"2 - Verifica que en la pantalla Respuestas de Lotes SII'[Datos Maestros > Datos Maestro Comercial >DM finanaza y contablidad] existen las respuestas: AQU_PARM, AQU_OK, AQU_RECH y AQU_ERROR Lanzar la tarea Recepción Incidencias Lotes SII '","data":"","result":"Preparación prueba","attachments":[]},{"id":907,"index":3,"step":"3 - Comprobar el valor del parámetro funcional SALIDA_LOTE_SII. En Oracle por defecto será SALIDA. En DB2 por defecto será un espacio en blanco. En nuestro caso solo efectuaremos la preba en Oracle. Lanzar la tarea de Recepción Incidencias Lotes SII.","data":"","result":"El funcionamiento será el mismo que antes pero la estructura de carpetas que en que se leerán y se moverán los ficheros de respuestas, que es: [BASE]\\[SISTEMACOMERCIAL]\\[CARPETA_SALIDA]\\[TIPO_RESP] donde [CARPETA_SALIDA] antes era en función del valor del campo Presentar SII a AEAT: o Valor N: será la carpeta “SALIDA” o Valor S: será la carpeta “SALIDA_AEAT” y ahora tiene que ser, en función del valor del campo Presentar SII a AEAT: o Valor N: el valor del parámetro funcional SALIDA_LOTE_SII o Valor S: el valor del parámetro funcional SALIDA_LOTE_SII seguido de _AEAT” Cuando el parámetro tiene el valor espacio en blanco, la carpeta SALIDA no se crea o es _AEAT'","attachments":[]},{"id":908,"index":4,"step":"4 - Comprobar que en la ubicación de lotes propios carpeta STATUS existe una respuesta de lote Correcto (el XML de respuesta tiene el campo <siiR:EstadoEnvio> = Correcto) Lanzar la tarea Recepción Incidencias Lotes SII (Mirar indicaciones abajo). Indicaciones: Para realizar la prueba se debe generar una respuesta, al no disponer de certificado y entorno de pruebas para generar dicha respuesta, se tiene que crear manualmente. Para ello hay que ir a la ruta de calidad: <a href='file://\\\\10.35.31.172\\uo_aqbs$\\Gestión\\Calidad\\Recursos'>\\\\10.35.31.172\\uo_aqbs$\\Gestión\\Calidad\\Recursos</a> QA\\respuesta envio directo SII Escoger uno de los tipos de respuesta de ejemplo (nuestro caso el aceptado) y susituir dentro del fichero escogido , los nº de facturas por los generados en un fichero previo de entrada (pruebas anteriores de entrada). Mirar caso de uso CU_CYFI_CYFI_Generar Lotes SII. Una vez efectuado, grabar el fichero sustituyendo el CIF del titulo por el CIF de la sociedad propietaria de la factura y el número de lote, por el número de lote de entrada donde estaban las facturas que hemos incluido. Se debe grabar en la carptea <a href='file://\\\\Srvabswas2\\APLICACIONES_QA\\SIIPRO\\CF_SECTOR\\SALIDA_AEAT\\STATUS'>\\\\Srvabswas2\\APLICACIONES_QA\\SIIPRO\\CF_SECTOR\\SALIDA_AEAT\\STATUS</a>'. Nota: La ruta de la carpeta donde grabar el fichero depende del campo 'tipo de lotes SII'dentro del 'detalle propietario de la cartera'{Explotación > Entra en la explotación donde actuamos > Pestaña Facturación > Subpestaña 'Generación de facturas'> Escoger el propietario de cartera de las facturas y hacer doble clic.}. La estructura de carpete se determina así: La estructura de carpetas donde se almacenan los ficheros de respuesta del AEAT es la siguiente: [BASE]\\[SISTEMACOMERCIAL]\\[CARPETA_SALIDA]\\[TIPO_RESP] Donde cada valor se obtiene según el tipo de lote procesado: • SISTEMACOMERCIAL: Valor del parámetro funcional SIST_COMERCIAL_LOTE_SII • BASE: En función del valor del campo Tipo de lote: o Ajeno: Propiedad del servidor para lotes ajenos (dir.LoteSIIAjeno) o De terceros: Propiedad del servidor para lotes propios (dir.LoteSIIPropio) o Propio: Propiedad del servidor para lotes propios (dir.LoteSIIPropio) • CARPETA_SALIDA: Es distinta en función del valor del campo Presentar SII a AEAT: o Valor N: Carpeta “SALIDA” Valor de la propiedad funcional SALIDA_LOTE_SII o Valor S: Carpeta “SALIDA_AEAT” Valor de la propiedad funcional SALIDA_LOTE_SII seguido de _AEAT Para las sociedades cuyo tipo de lote sea ‘De terceros’ o ‘Ajenos’, además se concatena con “_” + código de sociedad propietaria. • TIPO_RESP: Hay dos carpetas distintas: o STATUS: Carpeta en la que se depositan todos los ficheros de respuestas para su procesamiento automático. o ERROR: Carpeta en la que se duplican para su consulta manual por parte del usuario: - Los ficheros de respuestas que contienen algún error que impide el procesamiento del lote completo. Esto puede deberse a errores en la estructura del XML, a errores en la cabecera del fichero, o a errores en todas sus facturas. - Los ficheros de respuestas que contienen un identificador de respuesta o algún motivo de rechazo de lote o de factura que no ha sido parametrizado en AquaCIS. o PROCESADOS: Solo en implantaciones con conexión directa con la AEAT. Carpeta donde se depositan como copia de seguridad los duplicados de los ficheros de respuesta después de procesarlos. ? Nota: Los ficheros se deben eliminar de la carpeta manualmente. Se recomienda mantenerlos un periodo de tiempo prudencial por si hubiera algún problema y fuera necesario volver a procesarlos o consultarlos. lanzar la tarea 'Recepción Incidencias Lotes SII'","data":"","result":"En el lote se informa la respuesta AQU_OK, no se informa motivo de rechazo y el estado es CORRECTO El fichero de respuestas NO se ha copiado en la carpeta ERROR y se ha eliminado de la carpeta STATUS","attachments":[]},{"id":909,"index":5,"step":"5 - Consulta de Lotes SII Ir a la pantalla Generación Lotes SII [Contabilidad y finanza > Contablidad] Buscar lote ,al cual, hemos efectuado la respuesta en prueba anterior","data":"","result":"Verificar que el lote ,al cual, hemos efectuado la respuesta en prueba anterior ha cambiado de estado de generado'a 'Correcto'.'","attachments":[]}]}}},{"id":284,"testExecKey":"TEST-457","testKey":"TEST-450","status":"TODO","defects":[],"evidences":[],"testEnvironments":["QA"],"testIssueFields":{"summary":"PR-6020 - SII SIstema Inmediato de Información (AEAT) : Generar una Incidencia","customfield_12404":{"steps":[{"id":910,"index":1,"step":"1 - Ir a la pantalla Generación Lotes SII [Contabilidad y finanza > Contablidad] Entrar dentro del lotes y dirigirse a la pestaña facturas. Marcar una factura y hacer clic en Marcar para reenvio'","data":"","result":"La factura cambia su estado incial y actual a Validada","attachments":[]},{"id":911,"index":2,"step":"2 - Ir a la pantalla Incidencias SII Facturas[Contabilidad y finanza > Contablidad] buscar por Id lote que hemos generado la incidencia en el paso anterior.","data":"","result":"Verificar que aparece el registro en estado validada","attachments":[]},{"id":912,"index":3,"step":"3 - Ir a la pantalla Generación Lotes SII [Contabilidad y finanza > Contablidad] Entrar dentro del lotes y dirigirse a la pestaña facturas. Marcar una factura y hacer clic en Marcar para reenvio'","data":"","result":"verificamos que el estado actual ha cambiado a reenviada.","attachments":[]},{"id":913,"index":4,"step":"4 - Volver a lanzar la tarea Generació Lotes SII'e Ir a la pantalla Incidencias SII Facturas[Contabilidad y finanza > Contablidad] Buscar el lote del paso anterior'","data":"","result":"Verificar que aparece el registro en estado reenviada.","attachments":[]}]}}}]